{"path":".obsidian/plugins/text-extractor/cache/hy/040_profane-世俗-论文-英文-Hybridregressionmodelfornearreal-timeurbanwaterdemandforecasting.pdf-2bfeac4e024d721d679c854cc68a07f3.json","text":"Journal of Computational and Applied Mathematics 309 (2017) 532–541 Contents lists available at ScienceDirect Journal of Computational and Applied Mathematics journal homepage: www.elsevier.com/locate/cam Hybrid regression model for near real-time urban water demand forecasting ✩ Bruno M. Brentan a, Edevar Luvizotto Jr. a, Manuel Herrera b, Joaquín Izquierdo c,∗, Rafael Pérez-García c a LHC - FEC, University of Campinas, Campinas, Brazil b EDEn - Department of Architecture and Civil Eng., University of Bath, Bath, UK c Fluing - IMM, Universitat Politècnica de València, Valencia, Spain a r t i c l e i n f o Article history: Received 7 October 2015 Received in revised form 2 February 2016 MSC: 00-01 99-00 Keywords: Demand forecasting Water supply Fourier series Support vector regression Near real-time algorithms a b s t r a c t The most important factor in planning and operating water distribution systems is satisfy- ing consumer demand. This means continuously providing users with quality water in ad- equate volumes at reasonable pressure, thus ensuring reliable water distribution. In recent years, the application of statistical, machine learning, and artificial intelligence method- ologies has been fostered for water demand forecasting. However, there is still room for improvement; and new challenges regarding on-line predictive models for water demand have appeared. This work proposes applying support vector regression, as one of the cur- rently better machine learning options for short-term water demand forecasting, to build a base prediction. On this model, a Fourier time series process is built to improve the base prediction. This addition produces a tool able to eliminate many of the errors and much of the bias inherent in a fixed regression structure when responding to new incoming time series data. The final hybrid process is validated using demand data from a water utility in Franca, Brazil. Our model, being a near real-time model for water demand, may be directly exploited in water management decision-making processes. © 2016 Elsevier B.V. All rights reserved. 1. Introduction Long-term water demand forecasting is required for planning and designing new water distribution systems (WDSs) [1]. However, to satisfy safe operation and management of their systems and make right decisions about valve and pump manoeuvres, water utilities need to be acquainted with (near) real-time end-users behaviour regarding water consumption. In addition, having deep knowledge of water demand helps to identify and control possible leakages in the network, when observed consumption and demand prediction diverge far from the expected uncertainty [2,3]. Auto-regressive integrated moving average (ARIMA) based models [4] have been traditionally considered for understanding and modelling urban water demand [5]. ARIMA based models usually treat the problem as a linear correlation among variables and, according to Voitcu and Wong [6], this technique does not always produce predictions with sufficient accuracy, which can harm other processes, such as the control of the system. To cope with this situation, a number of ✩ This work has been partially supported by CAPES Foundation of Brazil’s Ministry of Education. The data were provided by SABESP, São Paulo state water management company. ∗ Corresponding author. E-mail address: jizquier@upv.es (J. Izquierdo). http://dx.doi.org/10.1016/j.cam.2016.02.009 0377-0427/© 2016 Elsevier B.V. All rights reserved. B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 533 data analysis models have been considered more recently. For instance, several authors [7–9] have applied artificial neural network (ANN) architectures to both long and short term demand forecasting. The use of other machine learning tools has also increased during the last years. [10] has performed a comprehensible comparison of various predictive methods for hourly water demand forecasting, suggesting the use of support vector regression (SVR) as one of the models through which it is possible to reach better results. These results are in agreement with the ones previously obtained by Msiza et al. [11], just comparing SVR against ANN architectures for daily water demand prediction. However, the straightforward use of SVR without any internal adaptation when new data arrives (off-line SVR) has two main drawbacks: the computational complexity of the training and validation phases, necessary for parameter tuning, and the selection of the best model among the validated proposals [12,13]. These two phases are highly time-consuming and lead to slow down the whole process, since it is strongly dependent on its associate database size. In addition, off-line predictive models are likely to develop certain growing bias, if models are not updated with the arrival of new data. The model can also become rapidly obsolete in the case of abrupt changes occurring in the forecasting framework. These are the models known as intervened [14], and are a consequence of unexpected changes in the scenario in which the demand is computed. For example, opening and closing valves, extreme variation of weather conditions, appearance of new leaks and celebration of a social events, among others, may change the end-user response regarding water demand. The majority of hydraulic models proposed in the literature are off-line, addressing a number of purposes such as network design optimization [15], strategy planning [16], and setting optimal pumping schedule to reduce energy [17]. However, off-line models do not represent well the current state of the water supply system for operational purposes, especially in emergency events [18,16]. The new paradigm of on-line modelling in WDSs is a topic of growing interest with the high amount of data information with which water utilities operate nowadays, aiming at making decisions in a very short time [15]. On-line predictive models for water demand forecasting [19,20] emerge to bridge the gap between this constant flow of available information and off-line models, which are not optimized to be updated in near real-time. Through on-line models for water demand, it is possible to improve predictions of water demand and to have better control of such system state variables as flow and pressure [19], by suitable valve operation. The aim of on-line prediction is to update the current model to a more accurate one, avoiding the computational burden associated with re-calculating the whole process each time new data are available. Vaerenbergh et al. [21] propose a sliding window methodology for kernel regression together with a fast optimization of its associate parameters. Other approaches are based on a fusion of methods for model updating [22]. In this sense, a number of hybrid methodologies for predictive models have been introduced in the literature. These are usually based on ARIMA models combined with alternative models attempting to capture forecasting non-linearities [23]. In general, this fusion of models increases model accuracy and reduces overfitting problems. For example, Aladag et al. [24] proposed a hybrid model linking ARIMA and ANN models; this hybrid model was applied to yearly demand forecast providing accurate results. A similar approach is used in [14] modelling water demand intervened (e.g. by open/close valve manoeuvres). In [25] a hybrid particle swarm optimization - support vector machine (PSO-SVM) based model is built as a predictive model of chemical component concentration in water. Our working proposal starts by choosing a suitable methodology among the standard machine learning options for regression analysis and run it for short-term water demand forecasting. In this case, we have selected SVR as one of the models that provides better results for water demand forecasting [11,26]. Built on top this model, an on-line process based on Fourier time series is launched to improve the predictions. The time series error associated with the SVR model is subsequently investigated through and adaptive Fourier series (AFS) technique, enabling to model any possible variation on the original pattern that could arise with the arrival of new data. The combination of these two perspectives endows the model with enough flexibility to be efficiently adapted before any unexpected scenario comes up. Working with a near real-time predictive model for water demand forecasting speeds up decision-making processes on water supply operation and management; in particular, it is useful in water disruption scenarios. The roadmap for the rest of the paper is as follows: Section 2 describes the hybrid forecasting method where the SVR and AFS equations, together with the hybridization process, are presented. Section 3 presents the water supply case study, the variables involved in the forecasting process, and the evaluation methodology. The results obtained at each step of the method are presented in Section 3.2, where results from SVR and SVR+AFS are analysed separately to give strong support to the hybrid model through clear improvement of results. The efficiency evaluation is also presented in this section. Section 4 presents a discussion on the results and conclusions about this work. 2. Hybrid method: Support vector regression+adaptive Fourier series This Section introduces our hybrid methodology proposal for near real-time water demand prediction. Firstly, both the off-line model (using SVR) and its corresponding on-line adjustments (via AFS) are succinctly explained. After that, we focus on its combination through modelling the historical record of errors produced by just using the basis off-line model, and justify the use of AFS to adjust those errors. Finally, the statistical parameters for evaluating the accuracy of the proposed model are presented. Also, an efficiency parameter to define a period for retuning the SVR model is developed. 534 B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 2.1. Support vector regression Common kernel-based learning methods [27,28] use an implicit mapping, φ, of the input data into a high dimensional feature. Then, a kernel function, K , is used to return the inner product  φ(x), φ(x ′)  between the images of two data points x, x ′ in the feature space. The choice of the map φ aims to convert the non-linear relations into linear ones. The learning then takes place in the feature space, while the learning algorithm can be expressed so that the data points only appear inside dot products with other points, readily calculated via the kernel. This is often referred to as the ‘‘kernel trick’’ [27,29]. The key characteristic of SVR is that it allows to specify a margin, ε, within which we are willing to accept errors in the sample data without they affecting the prediction quality. The SVR predictor is defined by those points or vectors which lie outside the region formed by the band of size ±ε around the regression. These vectors are the so-called support vectors. Given data {(x1, y1), . . . , (xn, yn)} ⊂ X × R, where X denotes the space of the input patterns, the goal is to find a function ˆf (x) = ⟨w, φ(x)⟩ + b, (1) that at most deviates ε from the observed output, yi, for all pairs (xi, yi) with i = 1, . . . , n; and at the same time minimizes the so-called model complexity, which depends on the support vectors (see Eq. (2)). min w,b 1 2 ∥w∥2 s. to |yi − ⟨w, φ(xi)⟩ − b| ≤ ε. (2) The constraints of Eq. (2) assume that ˆf (x) exists for all yi with precision ±ε. Nevertheless, the solution may actually not exist or, interestingly, it would be possible to achieve better predictions if outliers were allowed. The inclusion of slack variables on the regression penalizes deviations larger than ±ε but leaves room for both supporting approaches with possible infeasibilities and exploring a wider set of models. Thus we consider ξ + and ξ − such that: ξ + i = ˆf (xi) − y(xi) > ε (3) ξ − i = y(xi) − ˆf (xi) > ε, (4) so that the objective function and constraints for SVR is finally stated as min w,b 1 2 ∥w∥2 + C 1 n n i=1 (ξ + i + ξ − i ) s. to yi − ⟨w, φ(xi)⟩ − b ≤ ε + ξ + i , ⟨w, φ(xi)⟩ + b − yi ≤ ε + ξ − i , ξ + i , ξ − i ≥ 0 i = 1, . . . , n, (5) where n is the number of training patterns and C is a trade-off parameter between model complexity and training error. As said, ξ + and ξ − are slack variables for exceeding the target value by more than ε and for being below the target value by less than ε, respectively. This method of tolerating errors is said to be ε-insensitive [27]. 2.2. Adaptive Fourier series A Fourier series is an expansion of a periodic signal or function into the sum of a set of simple oscillating functions. It is a fact that water demand follows a quasi-periodic behaviour, with different periodic components (corresponding mainly to daily, weekly and seasonal demands). As a consequence, Fourier series are ideal candidates to model such variations. The Fourier series set of equations presented here is based on [30], where trigonometric adjustment is applied to data coming from both equally and not-equally spaced measurements. Taking equally spaced values of t in the period of interest, Eq. (6) normalizes the times to the interval [0, 2π ]. ti = 2π i N , (6) where ti is the normalized time, 0 ≤ ti ≤ 2π, i is the position of the point in the interval of evaluation and N is the total number of time intervals in the period of interest. The Fourier series approximation, f ∗, for a general function f at a point ti is written according to Eq. (7), f ∗(ti) = a0 + M j=1 (aj cos(jti) + bj sin(jti)), (7) where M is the length of the Fourier polynomial, and a0, aj and bj are the adjustable Fourier coefficients. B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 535 The differences between the real (measured, in our case) values of the function f and the estimated values, calculated by Eq. (7) enables us to obtain the square deviation s, given by Eq. (8). s = N−1 i=0  f (ti) −  a0 + M j=1 aj · cos(jti) + M j=1 bj · sin(jti) 2 . (8) The least square method to minimize s takes into account orthogonality conditions to calculate the parameters a0, aj and bj [30], which may be written as: a0 = N−1 i=0 f (ti) N , aj = 2 N−1 i=0 f (ti) cos(jti) N , bj = 2 N−1 i=0 f (ti) sin(jti) N . (9) Once these parameters have been determined, Eq. (7) is used to estimate f to functionally adjust the measured data. 2.3. Hybrid model SVR+AFS Hourly water demand is not a simple phenomenon to describe. The non-linear correlation between exogenous variables and the near periodical behaviour of consumption is difficult to predict while maintaining a certain error threshold. In addition, off-line models cannot respond to incidences or anomalies that happen in water distribution along the time. The proposed hybrid model provides a fast response to new weather or physical factors in the water demand environment by adding up an on-line predictive layer to a prior off-line regular predictor. The proposal is to use Fourier theory, as described in the last section, to model and predict the deviation for the prediction obtained by SVR. That is to say, a Fourier series layer over the SVR output will adjust better the minimum and maximum demand peaks and capture parts of the time series periodicity that SVR cannot reproduce. As a Fourier time series model has no special requirements to work out, it is also efficiently adapted to new scenarios regarding the exogenous inputs affecting water demand. The hybrid model aims to improve as well the usual SVR results by enhancing the capacity to capture, through Fourier series, other periodical features of the already considered variables based on weather and calendar data. The initial SVR model has to be well calibrated and trained before validation. The corresponding parameters are the following: • Parameter C , which gives a trade-off between model complexity and the amount up to which deviations larger than ε are tolerated. Furthermore, the robustness of the regression model depends on the choice of the C value; this means that the choice of C influences the significance of the individual data points in the training set. • Parameter ε regulates the radius of the ε tube around the regression function and thus the number of support vectors that finally will be selected to construct the regression function (leading to a sparse solution). A too large ε value results in less support vectors (more data points will be fit in the ε tube) and, consequently, in a smoother (less complex) regression function. Training begins by creating a mesh with pairs of C and ϵ. The values used in this work were based on [31], and have the following bounds: 0.05 ≤ ϵ ≤ 0.9 and 1 ≤ C ≤ 1500. This develops a Grid Search Method (GSM) as a classical option to tune the parameters in which equally spaced sampled points are used to represent all their possible combinations [32,33]. After the model selection process, consecutive runs of N demand observations are used to compute the deviation, s, between predicted and observed values of demand. One typically has that the SVR model error is larger at demand peaks and, as expected, has periodical behaviour. Fig. 1 shows the overall on-line process. As a novelty, we highlight the embedding of an optimal cycle for model (SVR) regeneration. This cycle is related with the model structure obsolescence. It does not need continuous updating but only after a certain number of predictions. This cycle is determined by controlling the model accuracy as Section 3.2 explains for the case study. Deviations between the observed demand and the demand predicted by the SVR model are computed at every time interval. The Fourier Series coefficients are updated using this new time series, modelling the on-line error of the model. The final demand predicted by the on-line hybrid model combines the water demand predicted by the SVR model, ySVR, and the predicted deviation estimated by the AFS model, fAFS . Eventually, the near real-time predicted demand may be written following Eq. (10). y = ySVR + fAFS. (10) 536 B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 Fig. 1. Flowchart of the on-line hybrid process SVR-AFS. Fig. 2. Diagram of AFS update. Fig. 2 shows the on-line updating scheme using AFS. The predicted correction not only incorporates the on-line attribute to the entire model, but also adds the last (more recent) measured water consumption as a new variable to the forecasting process sliding the window one time step further, this updating the database. The last water consumption has also been adopted in previous research as a way of incorporating the well-known inertial features of water demand [34,5]. 2.4. Computational efficiency The off-line water demand forecasting model must be regularly updated as new demand events arrive. Despite the on-line model is able to respond fast to new demands thus satisfying its main objective, namely contributing to the best operation and management of the system, as new data arrives, new correlations between water demand and input variables may appear turning obsolete the current base model (even in the case one works with on-line corrections). B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 537 Fig. 3. Water demand and weather variables series. Accordingly, the off-line model structure needs to be periodically updated through new data. Determining an optimal updating cycle is of paramount importance, while it is strongly dependent on the on-line model efficiency. Let T be the total CPU time spent to run the calibrated hybrid model corresponding to SVR prediction and AFS deviation adjustment. We define the efficiency parameter ϕ by Eq. (11): ϕ = Ntr e · T , (11) where e is the root mean square error (RMSE) and Ntr is the training data size. The product of e and T in the denominator accounts for the accuracy and the computational cost of the method. The training data endows the model with real data information; then, the higher the value of Ntr the lower the error, i.e. the model exhibits augmented reliability. However, the time necessary to obtain the new model structure will be higher for large values of Ntr . The value ϕ, thus describes a trade-off between accuracy and computational cost, that is to say, controls the behaviour of the model when it is trained using different sizes of training data. Maximizing ϕ, as performed in Section 3.2 for the case study, will produce the more suitable training data size Ntr . 3. Experimental study This study uses water demand data collected from a real district metered area (DMA) in Franca, Brazil. This DMA is mostly based on residential customers. Water consumption data corresponds to metered data at the DMA’s inlet every 20 min from May 2012 until December 2013. These measures are aggregated to handle an hourly demand rate data structure during the 570 days of this period. The analyses are conducted through a training window of 400 days. The following 140 days are taken to validate the model. Then new fresh 30 days are used to test the performance of the proposal. 3.1. Exploratory data analysis Previous studies found in the literature use variables taking into account weather and calendar information for generating models to predict water demand [35,36]. Fig. 3 visualizes the behaviour of water demand and different weather inputs. Time series data for the variables are plotted along with the box plot showing each individual variable distribution. Cross- correlation analyses have been carried out to check the impact of weather variables in water demand time series. As a result, the SVR model proposed in this paper uses rain, temperature, humidity, and wind velocity as the most important physical variables to consider for further analysis. While temperature and air humidity time series follow a regular distribution along all the time frame, wind velocity and rain present extreme values as can be observed in the box plots of Fig. 3. This figure also evidences direct correlations between air humidity and rain as well as temperature and water consumption. Cross-correlations computed for these time series show evidence enough to ensure the existence of correlation between these variables. Calendar information is important to analyse water demand, given that human behaviour is usually depending on the day of the week. Thus, week days have a different water consumption when compared with weekend days. In addition, holidays follow different consumption patterns than regular days. Taking this into account, we use markers for weekday/weekend and occurrence of holiday, while the model also handles information of the time of the day and the month of the year. Week 538 B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 2 4 6 8 10 12 14 16 18 20 22 24 15 20 25 30 35 40 45 Time (h)Water demand(l/s) Monday Tuesday Wednesday Thursday Friday Saturday Sunday 2 4 6 8 10 12 14 16 18 20 22 24 15 20 25 30 35 40 Time (h)Water demand(l/s) May Jun Jul Aug Sep Oct Nov (a) Water demand by weekday. (b) Water demand by months. Fig. 4. Comparison: (a) water demand by weeks and (b) water demand at same weekday along 9 months. 2 4 6 8 10 12 14 16 18 20 22 24 15 20 25 30 35 40 45 TimeWater demand Fig. 5. Water demand at various week days showing the holiday effect. day, hour and month attributes are enumerated with discrete variables while the occurrence of a holiday was classified with a binary variable. Fig. 4(a) shows different patterns for water demand when comparing days belonging to a typical week (no holiday). Cyclical behaviours and possible differences between months are also considered. For instance, there is a difference between June and July, as Fig. 4(b) shows. July is a typical Winter holiday month in Brazil with mild temperatures in which water consumption is higher than in June, a month with similar temperatures but not a vacation month. Fig. 5 shows a comparison between holidays and week days regarding water consumption using two representative days for each category, common week day and holiday, respectively. We can observe that the holiday water demand pattern usually has a lower consumption peak and a lower oscillation level during the day. 3.2. SVR-AFS results To evaluate the final predicted demand by the hybrid use of SVR demand and AFS deviation correction, this work uses the RMSE Eq. (12), the mean absolute percentage error (MAE%), Eq. (13), and the correlation coefficient (R2) [14,10]. RMSE =     1 n · T i=1 e 2 i , (12) MAE% = 1 n · T i=1 ei µobs · 100, (13) where ei is the deviation between observed and final predicted demand and µobs is the mean value for observed series. These statistical parameters allow model accuracy assessment. While the RMSE shows the squared difference between real and predicted demand, the MAE% outcome is the deviation compared with the mean value of the observed series. Regarding the training process, Table 1 shows the top 5 pairs of parameters. The best values of C and ϵ are 50 and 0.05, respectively. The process to find this best pair is based on computations with data for 20 weeks, and we work with the average values of the error, adding statistical robustness to the tuning process. The predicted demand using the best validated model is presented in Fig. 6. We can observe that the largest deviations occur at the maxima and minima. B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 539 Table 1 Best values C and ϵ in the training process. C ϵ MSE 50 0.05 20.83 50 0.125 20.86 50 0.200 20.91 50 0.275 20.95 50 0.375 21.00 20 40 60 80 100 120 140 160 15 20 25 30 35 40 45 TimeWater demand (l/s) Fig. 6. Water demand prediction using SVR compared with observed demand. 0 100 200 300 400 500 600 700 TimeError (l/s) Error –10 –5 0 5 10 15 20 (a) Error time series. 20 40 60 80 100 120 140 –5 0 5 10 15 TimeWater demand deviation(l/s) Observed AFS (b) Predicted and real error. Fig. 7. (a) deviation between real and SVR predicted demand and (b) AFS approximation of this deviation. Fig. 7(a) shows the performance of the SVR model in terms of the deviation respect to the observed data. The near- periodical deviation behaviour of this error time series justifies the use of Fourier methods. Fig. 7(b) shows the correction of this deviation error adjusted by the AFS. Finally, the hybrid model result is presented in Fig. 8(a) compared with the real water demand. Table 2 shows the statistical parameters for both the single SVR and the hybrid model. Fig. 8(b) presents the correlation between the observed demand and the SVR prediction and also between the observed demand and the SVR-AFS prediction. The a posteriori application of AFS allows the use of a single off-line SVR as demand base model, since AFS is able to quickly adapt the predictions to the new data available. The use of AFS is based on the quasi-periodic shape of the deviations between observed data and predicted values by SVR (see Fig. 6). AFS is accurate in predicting these deviations and the results of the hybrid model have been significantly improved regarding the off-line proposal. Fig. 8(a) proves that the maximum 540 B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 Table 2 Model comparison. Model RMSE MAE% R 2 SVR 4.767 12.91 0.745 SVM-AFS 1.318 3.45 0.974 20 40 60 80 100 120 140 160 15 20 25 30 35 40 45 TimeWater demand Observed SVR–AFS 10 15 20 25 30 35 40 45 50 Predicted Demand (l/s)Observed Demand (l/s) SVR SVM+AFS 15 20 25 30 35 40 45 50 (a) Hybrid SVR-AFS model predictions vs. observed demand. (b) Comparison between SVR and SVR-AFS prediction vs. observed demand. Fig. 8. Hybrid SVR-AFS results: (a) time series comparison and (b) correlations with observed water demand.Efficiency 30 40 50 60 70 80 90 100 110 Training data size 0 1000 2000 3000 4000 5000 6000 7000 8000 9000 10000 11000 12000 Fig. 9. Efficiency values for different training data sizes. and minimum values are better described by the hybrid model. The CPU time for the AFS model is constant, in this case equal to 16.5 s. This fact together with the agility of the algorithm allow near real-time water demand prediction. The evaluation of the model efficiency with respect to the size of the training data enable us to find the best training cycle for completely updating the off-line model. Fig. 9 presents the evolution of the training cycle efficiency for a range of data sizes. In this case, the optimal data size to refresh the SVR model is, accordingly, 3000 registers, which corresponds to 125 days. With less than that number of data the model does not reach its maximum efficiency, mainly because the error is big (although the on-line model supplements the gap of new data). After this point the computational cost increases without a significant RMSE reduction. All the computations for SVR and AFS models were performed within MatLab, on a 64 bit Linux Debian-based operating system, Ubuntu 15.04, installed on a 2.4 GHz Intel R⃝ Xeon(R) CPU E5-2665 0 with 16 Cores. The LibSVM Matlab toolbox [37] has been used and adapted for relevant routines dealing with support vector machines regression. 4. Conclusions This article has presented a hybrid model for hourly water demand forecasting. The model builds on an off-line support vector regression model, constituting a forecasting base, and an on-line adaptive Fourier series for forecasting deviation. SVR accounts for physical and calendar information necessary for water demand forecasting, as these parameters are the SVR input. The prediction using an SVR model is able to describe the shape or general pattern of the daily demand. However, it is not able to capture well the extremes (maxima and minima) and, as a result, the accuracy diminishes at the demand peaks. It is well known that model obsolescence is a common issue for any predictive model based on the straightforward use of machine learning regression models. The use of the adaptive Fourier series adds to the SVR model a way to update the prediction in near real-time by correcting the demand predicted by the off-line base model. A further advantage of AFS is the addition of another social variable involved in the problem: the most recent level of water demand. B.M. Brentan et al. / Journal of Computational and Applied Mathematics 309 (2017) 532–541 541 The paper also introduces a simple way to determine the optimum training data size for the off-line model, which con- siders computational effort and error. The ideal cycle of training can help water companies to organize interruptions of the model activity for updating with new data. Updating the model is important since new data supplements the model with new correlations for the demand and input variables. The proposed model can be an important tool for water utilities, since the on-line feature supports operation and management of WDSs, allowing operators to programme efficient manoeuvres to save energy and water. References [1] S. Behboudian, M. Tabesh, M. Falahnezhad, F.A. Ghavanini, A long-term prediction of domestic water demand using preprocessing in artificial neural network, J. Water Supply Res. Technol. 63 (1) (2014) 31–42. [2] R. Klempous, J. Kotowski, J. Nikodem, J. Ułasiewicz, Optimization algorithms of operative control in water distribution systems, J. Comput. Appl. Math. 84 (1) (1997) 81–99. [3] F. Odan, L. Reis, Hybrid water demand forecasting model associating artificial neural network with fourier series, J. Water. Resour. Plan. Manag. 138 (3) (2012) 245–256. [4] G.P. Box, G.M. Jenkins, Times Series Analysis: Forecasting and Control, Holden-Day, 1976. [5] S. Alvisi, M. Franchini, A. Marinelli, A short-term, pattern-based model for water-demand forecasting, J. Hydroinform. 9 (1) (2007) 39–50. [6] O. Voitcu, Y.S. Wong, On the construction of a nonlinear recursive predictor, J. Comput. Appl. Math. 190 (1) (2006) 393–407. [7] M. Tiwari, J. Adamowski, Medium-term urban water demand forecasting with limited data using an ensemble wavelet–bootstrap machine-learning approach, J. Water. Resour. Plan. Manag. 141 (2) (2015) 04014053. [8] C. Bennett, R.A. Stewart, C.D. Beal, ANN-based residential water end-use demand forecasting model, Expert Syst. Appl. 40 (4) (2013) 1014–1023. [9] S. Zhou, T. McMahon, A. Walton, J. Lewis, Forecasting operational demand for an urban water supply zone, J. Hydrol. 259 (1) (2002) 189–202. [10] M. Herrera, L. Torgo, J. Izquierdo, R. Pérez-García, Predictive models for forecasting hourly urban water demand, J. Hydrol. 387 (1–2) (2010) 141–150. [11] I.S. Msiza, F.V. Nelwamondo, T. Marwala, Artificial neural networks and support vector machines for water demand time series forecasting, in: 2007. ISIC. IEEE International Conference on Systems, Man and Cybernetics, IEEE, 2007, pp. 638–643. [12] C.L.Z. Tu-Qiao, Hourly water demand forecast model based on bayesian least squares support vector machine, J. Tianjin Univ. 9 (2006) 005. [13] I. Banicescu, R.L. Cariño, J.L. Harvill, J.P. Lestrade, Investigating asymptotic properties of vector nonlinear time series models, J. Comput. Appl. Math. 236 (3) (2011) 411–421. [14] M. Herrera, J. García-Díaz, J. Izquierdo, R. Pérez-García, Municipal water demand forecasting: tools for intervention time series, Stoch. Anal. Appl. 29 (6) (2011) 998–1007. [15] I. Montalvo, J. Deuerlein, Driving online simulations in water distribution systems, Procedia Eng. 70 (2014) 1183–1191. [16] J. Machell, S. Mounce, J. Boxall, Online modelling of water distribution systems: a UK case study, Drink. Water Eng. Sci. 3 (2010) 21–27. [17] M. López-Ibáñez, T.D. Prasad, B. Paechter, Ant colony optimization for optimal control of pumps in water distribution networks, J. Water. Resour. Plan. Manag. 134 (4) (2008) 337–346. [18] A. Preis, A. Whittle, A. Ostfeld, Online Hydraulic State Prediction for Water Distribution Systems, 2009, Ch. 31, pp. 1–23. [19] I. Okeya, Z. Kapelan, C. Hutton, D. Naga, Online modelling of water distribution system using data assimilation, Procedia Eng. 70 (2014) 1261–1270. [20] M. Herrera, J. Izquierdo, R. Pérez-García, D. Ayala-Cabrera, On-line learning of predictive kernel models for urban water demand in a smart city, Procedia Eng. 70 (2014) 791–799. [21] S. Van Vaerenbergh, J. Vía, I. Santamaría, A sliding-window kernel RLS algorithm and its application to nonlinear channel identification, in: IEEE International Conference on Acoustics, Speech and Signal Processing, ICASSP 2006, Toulouse, France, 2006. [22] S. Hoi, R. Jin, P. Zhao, T. Yang, Online multiple kernel classification, Mach. Learn. 90 (2) (2013) 289–316. [23] G.P. Zhang, Time series forecasting using a hybrid arima and neural network model, Neurocomputing 50 (2003) 159–175. [24] C.H. Aladag, E. Egrioglu, C. Kadilar, Forecasting nonlinear time series with a hybrid methodology, Appl. Math. Lett. 22 (9) (2009) 1467–1470. [25] P.G. Nieto, E. García-Gonzalo, J.A. Fernández, C.D. Muñiz, A hybrid PSO optimized SVM-based model for predicting a successful growth cycle of the Spirulina platensis from raceway experiments data, J. Comput. Appl. Math. (2016) 293–303. [26] M. Herrera, S. Canu, A. Karatzoglou, R. Pérez-García, J. Izquierdo, An approach to water supply clusters by semi-supervised learning, in: D. A. Swayne, W. Yang, A. Voinov, A. Rizzoli, T. Filatova (Eds.), International Congress on Environmental Modelling and Software, International Environmental Modelling and Software Society, iEMSs, 2010, pp. 1925–1932, student’s award. [27] B. Schölkopf, A.J. Smola, Learning with kernels: support vector machines, regularization, optimization, and beyond, in: Adaptive Computation and Machine Learning, The MIT press, Cambridge, MA, USA, 2002. [28] J. Shawe-Taylor, N. Cristianini, Kernel Methods for Pattern Analysis, Cambridge University Press, 2006. [29] B. Schölkopf, The kernel trick for distances, Tech. Rep., Microsoft Research, 2000. [30] E. Luvizotto Jr, Representation of characteristic curves of hydraulic machines for computational simulations (Ph.D. thesis), University of São Paulo, 1992. [31] H.-T. Lin, C.-J. Lin, A Study on Sigmoid Kernels for SVM and the Training of non-PSD Kernels by SMO-type Methods. Technical report, Department of Computer Science, National Taiwan University, 2003, http://www.csie.ntu.edu.tw/~cjlin/papers/tanh.pdf. [32] J. Wang, X. Wu, C. Zhang, Support vector machines based on k-means clustering for real-time business intelligence systems, Int. J. Bus. Intell. Data Min. 1 (1) (2005) 54–64. [33] C.-W. Hsu, C.-C. Chang, C.-J. Lin, et al. A practical guide to support vector classification, 2003. [34] J. Zhang, R. Song, N.R. Bhaskar, M.N. French, Short term water demand forecasting: a case study, in: 8th Annual Water Distribution Systems Analysis Symposium, ASCE Library, Cincinnati, 2006. [35] M.A. Al-Zahrani, A. Abo-Monasar, Urban residential water demand prediction based on artificial neural networks and time series models, Water Resour. Manag. 29 (2015) 3651–3662. [36] M. Bakker, H. Van Duist, K. Van Schagen, J. Vreeburg, L. Rietveld, Improving the performance of water demand forecasting models by using weather input, Procedia Eng. 70 (2014) 93–102. [37] C.-C. Chang, C.-J. Lin, Libsvm: A library for support vector machines, ACM Trans. Intell. Syst. Technol. 2 (3) (2011) 27.","libVersion":"0.0.0","langs":"","hash":"","size":0}