{"path":".obsidian/plugins/text-extractor/cache/还在/040profane-世俗-论文-【小绿鲸】超棒的英文文献阅读器（附安装包+总结笔记+思维导图）-1.基本功能介绍-还在用EndNote你就out了！这个国产神器才是文献阅读中的战斗机！.pdf-4cda56e43e6bac423edd7f3a978f893e.json","text":"2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 1 / 8 还 在 用 E n d N o t e 你 就 o u t 了 ！ 这 个 国 产 神 器 才 是 文 献 阅 读 中 的 战 斗 机 ！ 风 靡 科 研 圈 的 国 产 科 研 神 器 ， 划 至 文 末 免 费 领 取 ！ 科 研 汪 看 文 献 时 都 会 遇 到 的 3 大 难 ， 不 信 你 没 中 招 ！ 1 、 读 英 文 文 献 贼 费 劲 ， 翻 译 软 件 不 准 不 说 ， 来 回 切 换 窗 口 很 麻 烦 2 、 文 献 看 完 难 以 g e t 要 点 ， 读 毕 脑 袋 空 空 一 脸 懵 3 、 时 间 久 了 D 盘 塞 满 各 类 P D F ， 下 个 国 外 管 理 软 件 发 现 上 手 也 太 难 了 还 死 贵 … 灵 魂 发 问 ： 就 没 有 一 款 免 费 好 用 又 适 合 国 人 的 文 献 阅 读 软 件 吗 ？ 它 集 合 了 5 大 主 流 翻 译 引 擎 ， 独 有 的 学 术 翻 译 引 擎 精 准 度 “ 近 乎 真 人 ” ； 支 持 边 读 边 做 笔 记 ， 灵 感 启 思 全 捕 捉 ； 它 的 文 献 管 理 功 能 让 科 研 小 白 也 能 轻 松 上 手 ； 它 还 可 以 电 脑 、 平 板 、 手 机 三 端 同 步 阅 读 ， 更 重 要 的 是 它 可 以 永 久 免 费 使 用 ！ 完 全 就 是 随 时 随 地 、 高 效 读 文 献 的 “ 战 斗 机 ” ~ （ 心 急 的 小 伙 伴 ， 可 滑 到 文 末 免 费 领 取 ） 1 5 大 翻 译 引 擎 结 合 使 用 堪 比 “ 人 工 翻 译 ” ， 实 现 用 中 文 读 S C I 1 、 5 大 翻 译 引 擎 ， 一 键 切 换 高 效 便 捷 小 鲸 2 0 2 2 - 0 9 - 2 9 1 1 : 3 2 发 表 于 江 苏原创 小 绿 鲸 文 献 阅 读 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 2 / 8 其 中 小 绿 鲸 团 队 历 时 多 年 研 发 的 鲸 译 A I 学 术 翻 译 引 擎 ， 翻 译 精 准 流 畅 ， 且 更 加 符 合 中 文 的 阅 读 习 惯 ！ 光 说 不 练 假 把 式 ！ 我 们 随 机 提 取 某 基 础 医 学 S C I 中 的 一 段 话 ， 对 比 “ 鲸 译 A I 通 用 版 翻 译 ” 与 “ 某 度 翻 译 ” 的 结 果 ： 原 文 Reporter assays combined with proteo mic and immunopeptidomic analyses demonstrated the induction of ribosomal frameshiftin g, and the generation and presen tation of aberrant transframe peptides at the cell surface after treatment with IFNγ. 某 度 翻 译 鲸 译 A I 通 用 版 翻 译 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 3 / 8 小 绿 鲸 完 胜 2 、 一 键 全 文 翻 译 ， 中 英 对 照 阅 读 除 了 常 用 的 划 词 翻 译 、 O C R 识 别 翻 译 、 单 词 翻 译 ， 小 绿 鲸 还 推 出 了 “ 全 文 翻 译 ” 。 将 英 文 一 键 转 换 成 中 文 ， 让 你 轻 轻 松 松 看 百 页 文 献 ， 译 文 保 留 了 原 文 格 式 ， 方 便 对 照 阅 读 ， 还 支 持 以 w o r d 和 P D F 格 式 下 载 ， 方 便 修 改 。 3 、 独 有 的 学 科 翻 译 功 能 ， 更 自 由 除 了 通 用 版 的 学 术 翻 译 引 擎 外 ， 小 绿 鲸 还 推 出 了 “ 鲸 译 A I 学 科 版 ” ， 支 持 无 限 添 加 你 的 本 专 业 术 语 库 ， 实 现 自 定 义 翻 译 结 果 ， 让 每 个 科 研 人 都 可 以 拥 有 自 己 的 专 属 表 达 。 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 4 / 8 （ 心 急 的 小 伙 伴 ， 可 滑 到 文 末 免 费 领 取 ） 2 清 华 教 授 力 荐 的 “ 笔 记 阅 读 法 ” 一 键 生 成 思 维 导 图 ， 助 你 理 清 文 章 思 路 为 什 么 要 做 文 献 笔 记 ？ 清 华 大 学 教 授 曾 表 示 ： “ 做 文 献 笔 记 不 是 简 单 摘 抄 ， 而 要 记 录 核 心 内 容 及 自 己 的 思 考 分 析 ， 这 样 方 便 及 时 复 习 、 梳 理 文 章 结 构 ， 提 高 阅 读 效 率 … ” 小 绿 鲸 英 文 文 献 阅 读 器 ， 可 直 接 在 文 献 中 创 建 笔 记 。 笔 记 以 大 纲 形 式 呈 现 ， 可 一 键 转 换 成 思 维 导 图 。 它 还 提 供 “ 课 题 设 计 、 组 会 汇 报 、 综 述 写 作 ” 等 笔 记 模 板 ， 最 懂 国 人 科 研 习 惯 的 软 件 还 得 小 绿 鲸 ！ 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 5 / 8 3 文 献 速 读 + 语 料 收 藏 解 决 选 题 、 实 验 、 写 作 难 做 科 研 没 有 选 题 ， 等 同 于 “ 巧 妇 难 为 无 米 之 炊 ” 。 小 绿 鲸 的 速 读 功 能 可 提 炼 文 献 中 的 图 表 和 参 考 文 献 ， 让 你 快 速 掌 握 文 献 重 点 ， 进 行 文 献 追 溯 。 阅 读 过 程 中 ， 可 随 时 收 藏 语 料 和 引 文 ， 支 持 在 线 改 写 和 文 献 引 用 ， 提 高 写 作 效 率 。 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 6 / 8 < 滑 动 查 看 下 一 张 图 片 > 4 文 献 分 类 管 理 + 手 机 电 脑 同 步 阅 读 随 时 随 地 ， 高 效 读 文 献 文 献 导 入 到 小 绿 鲸 英 文 文 献 阅 读 器 后 ， 可 自 动 抓 取 文 献 信 息 （ 包 括 影 响 因 子 和 分 区 ） ， 还 可 以 无 限 创 建 文 件 夹 给 文 献 分 类 、 打 标 签 、 标 记 重 要 度 、 文 件 快 速 搜 索 等 。 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 7 / 8 手 机 、 平 板 、 电 脑 3 端 可 同 步 阅 读 。 百 度 搜 索 【 小 绿 鲸 】 ， 登 录 官 网 就 能 永 久 免 费 使 用 ， 也 不 必 担 心 M a c 和 W i n d o w s 系 统 不 兼 容 的 问 题 ， 真 正 让 你 随 时 随 地 、 高 效 读 文 献 。 ◆ 超 5 1 万 注 册 用 户 ， 全 网 9 6 % 好 评 ◆ （ 上 下 滑 动 查 看 ） 2022/10/28 还在用 EndNote 你就 out 了！这个国产神器才是文献阅读中的战斗机！ https://mp.weixin.qq.com/s/IpwwSRRHczjKlJlJ10SEMw 8 / 8 喜 欢 此 内 容 的 人 还 喜 欢 官 方 福 利 小 绿 鲸 激 活 码 限 量 发 放 中 5 大 专 业 翻 译 引 擎 ， 全 文 翻 译 对 照 阅 读 高 效 吃 透 英 文 文 献 ， 数 倍 提 升 科 研 效 率 每 天 仅 限 前 9 9 9 个 名 额 现 在 扫 码 ， 立 抢 激 活 码 据 说 点 “ 在 看 ” 的 都 能 随 时 迸 发 科 研 灵 感 血 脂 为 何 物 ？ 如 何 看 懂 血 脂 报 告 单 ？ 荆 医 检 验 i O S 最 强 文 件 管 理 器 - F i l z a , 已 激 活 完 整 版 ！ I O S 福 利 社 【 软 件 分 享 】 传 统 下 载 数 据 F T P （ 附 安 装 包 + 教 程 ） 小 火 苗 G I S","libVersion":"0.0.0","langs":"","hash":"","size":0}