{"path":".obsidian/plugins/text-extractor/cache/pr/040_profane-世俗-论文-英文-Predicting water demand_ a review of the methodsemployed and future possibilities(1).pdf-630ae5c4c1036f6dca64066fd9c35ec9.json","text":"Predicting water demand: a review of the methods employed and future possibilities Gustavo de Souza Groppo, Marcelo Azevedo Costa and Marcelo Libânio ABSTRACT The balance between water supply and demand requires efﬁcient water supply system management techniques. This balance is achieved through operational actions, many of which require the application of forecasting concepts and tools. In this article, recent research on urban water demand forecasting employing artiﬁcial intelligence is reviewed, aiming to present the ‘state of the art’ on the subject and provide some guidance regarding methods and models to research and professional sanitation companies. The review covers the models developed using standard statistical techniques, such as linear regression or time-series analysis, or techniques based on Soft Computing. This review shows that the studies are, mostly, focused on the management of the operating systems. There is, therefore, room for long-term forecasts. It is worth noting that there is no global model that surpasses all the methods for all cases, it being necessary to study each region separately, evaluating the strengths of each model or the combination of methods. The use of statistical applications of Machine Learning and Artiﬁcial Intelligence methodologies has grown considerably in recent years. However, there is still room for improvement with regard to water demand forecasting. Gustavo de Souza Groppo Federal University of Minas Gerais, Belo Horizonte, MG, Brazil and Companhia de Saneamento de Minas Gerais COPASA-MG, Rua Mar de Espanha, 525, CEP: 30.330-900, Belo Horizonte, MG, Brazil Marcelo Azevedo Costa Department of Production Engineering, Federal University of Minas Gerais, Belo Horizonte, MG, Brazil Marcelo Libânio (corresponding author) Department of Sanitary and Environmental Engineering, Federal University of Minas Gerais, Belo Horizonte, MG, Brazil E-mail: marcelo@desa.ufmg.br Key words | Artiﬁcial Intelligence, Machine Learning, Soft Computing, water demand prediction ABBREVIATIONS ACO Ant Colony Optimization ACPSO Adaptive Chaos Particle Swarm Optimization AFS Adaptive Fourier Series AMALGAM Multi-Algorithm Genetically Adaptive Method ANFIS Adaptive Neuro-Fuzzy Inference System ANN Artiﬁcial Neural Networks AP Average Price ARIMA Autoregressive Integrated Moving Averages B Bootstrap B-ANN Bootstrap Artiﬁcial Neural Networks B-ELM Bootstrap Extreme Learning Machine BPCA Bayesian Principal Component Analysis CCNN Cascade Correlation Neural Networks CMF Cumulative Weighting Mean Fuzzy CNN or ConvNet Convolutional Neural Network DAN2 Dynamic Artiﬁcial Neural Networks DAN2-H Dynamic Artiﬁcial Neural Networks Hybrid DFS Demand Forecasting System DMA District Metered Areas E-ANN Evolutionary Artiﬁcial Neural Networks EC Evolutionary Computation EDBD Extended Delta Bar Delta EKF Extended Kalman Filter EKF-PG Extended Kalman Filter with Programming Genetic ELM Extreme Learning Machine 2179 © IWA Publishing 2019 Water Supply | 19.8 | 2019 doi: 10.2166/ws.2019.122 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 EMD Empirical Mode Decomposition EMD-ANN Empirical Mode Decomposition Artiﬁcial Neural Networks ESNN Echo State Neural Network FFNN Feedforward Neural Networks FIS Fuzzy Inference Systems FL Fuzzy Logic FLR Fuzzy Linear Regression FRNN Totally Recurrent Neural Network FTS Fuzzy Takagi–Sugeno GA Genetic Algorithms GARCH Generalized Autoregressive Conditional Heteroscedasticity GRASP Agile Adaptive Randomization GRNN Generalized Regression Neural Networks GSAA Genetic Simulated Annealing Algorithm HW Holt–Winters IMF Intrinsic Mode Function K-NN K-Nearest Neighbors LF-DFNN Local Feedback Dynamic Neural Network LRGF Local Recurrent Global Feedforward LS-SVM Least-Squares Support Vector Machine LSTM Long Short-Term Memory LTF Linear Transfer Function MAPE Mean Absolute Percentage Error MARS Multivariate Adaptive Regression Splines MFIS Mandami Fuzzy Inference Systems ML Machine Learning MLP Multilayer Perceptron MLR Multiple Linear Regression MNLR Multiple Non-Linear Regression MP Marginal Price MSE Mean Square Error MSE Mean Squared Error MS-RVR Multi-Scale Relevance Vector Regressor NC Neural Computing NLRM Non-Linear Regression Multiple NSI Nash–Sutcliffe Index PPR Projection Pursuit Regression PR Probability Ratio RBNN Radial Basis Neural Networks RF Random Forest RVR Relevance Vector Regressor RW Random Walk RWD Random Walk with Drift SAR Spatial Autoregressive SARMA Spatial Autoregressive Moving Average SC Soft Computing SEM Spatial Error Model SVD Singular Value Decomposition SVR Support Vector Regression TDNN Time Delayed Neural Network TS-GRNN Time Series Generalized Regression Neural Networks VAR Vector Autoregressive W Wavelet W-ANN Wavelet Artiﬁcial Neural Networks WB-ANN Wavelet-Bootstrap Artiﬁcial Neural Networks WDF Water Demand Forecasting Module W-ELM Wavelet Extreme Learning Machine WPatt Weighted Pattern WSS Water Supply System WSZ Water Supply Zone YWS Yorkshire Water Services RRMSE Relative Root Mean Square Error R2 Coefﬁcient of Determination AREP Average Relative Error Percentage NRMSE Normalized Root Mean Square Error AARE Average Absolute Relative Error max ARE Maximum Absolute Relative Error R Correlation Coefﬁcient ts Threshold Statistic HM p-value Henriksson and Merton Probability Value U-Statistic Theil Inequality Coefﬁcient SEP Standard Error of Prediction PI Persistence Index RMS Absolute Error Measure NMSE Normal Mean Square Error LM Lagrange Multiplier LR Lagrange Robust Moran I Moran I Statistic Pdv Percentage Deviation in Peak 2180 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 INTRODUCTION Making a sufﬁcient amount of potable water available rep- resents a great challenge, especially in large cities. Cities have grown without appropriate planning, resulting in removal of vegetation cover and rendering soil imperme- able. This has caused hydrological and meteorological alterations, such as increasing air temperature, evapotran- spiration and ﬂood risk. Consequently, water has become less available, due to either the pollution or devastation of protected water source areas. Thus, the available water supply sources are far from urban centers, making water exploration increasingly more expensive. Dealing with these problems requires efﬁcient water supply system (WSS) management techniques, in order to maintain a balance between supply and demand. Mainten- ance of this balance is achieved through operational actions, many of which require application of forecasting tools. Due to the importance of water demand forecasting, many researchers and professionals have recently started to study it, as described in Ghalehkhondabi et al. (). The number of published articles has increased exponen- tially over the last 20 years, as shown in the Web of Science (Thomson Reuters). This increase may reﬂect the growing scarcity of water resources and the growing impor- tance of water demand management. Therefore, managers are concerned with planning WSS to meet water demand at lower operating costs. According to Ghiassi et al. (), the optimization of operations can result in substantial savings of 25% to 30% in operating costs, due to the reduction of costs with electricity and treat- ment inputs. Similar ﬁndings are presented by Odan (). At the same time, there has been intensiﬁed evaluation of the existing infrastructure and expansion strategies (master plan and project/construction project study). The master plans aim at long-term investment, anticipating the water demands of the expected vegetative growth, geo- graphic expansion and the socioeconomic and climatic variables that modify consumption behavior over time. Numerous factors affect the demanded water quantity. The most important are: climatic conditions such as tempera- ture; precipitation and relative humidity; size of the population; water pressure in the network; losses in the system; price structure (residential, commercial, industrial and public); supply and water metering system (hydro- metric); household income, size and outdoor space (Arbués et al. ; Tsutiya ; Wentz & Gober ; Schleich & Hillenbrand ; Nauges & Whittington ; de Maria André & Carvalho ). After extensive literature review, Donkor et al. () concluded that the application of a given method depends on the periodicity and the forecast horizon. According to these authors, neural networks were more likely to be used in short-term forecasting, while econometric methods and simulations were more frequently employed in the long-term forecast. Similar conclusions were found by Ghalehkhondabi et al. (). For these authors, Soft Com- puting (SC) methods were used mainly in the short-term forecast. According to Brentan et al. (), the use of stat- istical applications of Machine Learning and Artiﬁcial Intelligence methodologies in water demand forecasting has grown considerably in recent years. The term Soft Computing, also referred to as Compu- tational Intelligence, is the combination of emerging problem-solving technologies such as Fuzzy Logic (FL), Neural Computing (NC), Genetic Algorithms (GA), Evol- utionary Computation (EC), Machine Learning (ML), Probability Ratio (PR) and complementary hybrids. SC hybrid systems are further described in Bonissone (). Each of these technologies provides complementary reason- ing and complex, real-world problem-solving methods. A particularly effective combination is known as ‘neuro-fuzzy systems’. The objective of this paper is to present an extensive review of urban water demand forecasting methods to sani- tation professionals and researchers, thereby providing basic guidelines for practical applications. The review covers the models developed using standard statistical techniques, such as linear regression or time-series analysis, or tech- niques based on SC. Methods to support near-real-time water distribution system (WDS) management tasks, such as online pump pro- gramming and dynamic hydraulic modeling, have received less attention. Although dynamic systems are applied to water prediction problems, their application is quite limited 2181 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 when compared with other SC methods (Ghalehkhondabi et al. ). This paper is organized as follows. Publications related to each investigated method are presented in the second section. Discussions, addressing the results of the review, are presented in the third section. Final considerations and suggestions for future research are presented in the fourth section. DEMAND FORECASTING METHODS Demand forecasting methods can be broadly classiﬁed as linear and non-linear (Zhang ). Linear methods use uni- variate time series analysis, such as exponential smoothing, Autoregressive Integrated Moving Averages (ARIMA) and linear regression methods (MLR) (e.g., Adamowski & Karapataki ; Caiado ; Adamowski et al. ). Non-linear methods use non-linear regression methods (MNLR), Artiﬁcial Neural Networks (ANN) (e.g., Ghiassi et al. ; Firat et al. b; Firat et al. ; Adamowski & Karapataki ), FL (e.g., Altunkaynak et al. ; Firat et al. a), Support Vector Machine (SVM) (Peña- Guzmán et al. ), GA, expert systems (e.g., Altunkaynak et al. ; Nasseri et al. ) and hybrid methods. Artiﬁcial Neural Networks ANN are very useful forecasting tools, due to several factors. The ﬁrst is related to the requirement for a lower number of hypotheses, as compared with traditional statistical methods. A second factor relates to the generalization of results and the prediction of not-observed data (Zhang et al. ). A third factor relates to the ability to deal with different degrees of non-linearity present in the water demand data. That is, they are able to model highly non- linear relations among the data and to estimate non-linear functions with a high degree of precision. According to Adamowski et al. (), ANN allow the use of historical series to predict future values of the possibly noisy multi- variate time series. Ghiassi et al. () developed a Dynamic Artiﬁcial Neural Network (DAN2) method to predict water demand in a city of California. This dynamic method is a special case of feedforward architecture (FFNN). The developed method performed better than the ARIMA and ANN methods, thus proving to be more effective for predicting water demand. The authors noted that the inclusion of meteorological information in forecasting models increases accuracy. However, even when using only water demand data, DAN2 methods provide excellent adjustments. The results obtained for monthly, weekly and daily forecasts were highly accurate, as well as the hourly models. These results demonstrate excellent efﬁcacy for DAN2 in predict- ing urban water demand for all time horizons. Firat et al. (b) estimated the monthly forecast for water demand in the city of Izmir (Turkey) using various neural network techniques such as Generalized Regression Neural Net- works (GRNN), Feedforward Neural Networks (FFNN) and Radial Basis Neural Networks (RBNN). They used var- ious socioeconomic and climatic factors that affect consumption (average monthly water consumption, popu- lation, number of households, gross national product, average monthly temperature, total monthly rainfall, monthly average humidity and inﬂation). The data set was divided into two subsets (training and testing). The methods that obtained the best adjustments were also compared with the Multiple Linear Regression (MLR) method. The obtained results indicated that the GRNN outperforms all other methods in the modeling of monthly water consumption. Subsequently, Firat et al. () also estimated the monthly water demand forecast, employing a number of ANN techniques, including Cascade Correlation Neural Network (CCNN), GRNN and FFNN. Six prediction models were constructed. The best adjustment input struc- ture was investigated by comparing the techniques employed. The M5-CCNN model comprising a CCNN net- work with ﬁve-month lags proved to be more efﬁcient than the other models. When comparing the results using the three ANN techniques, the M5-CCNN model performed slightly better than the others. Adamowski & Karapataki () analyzed water demand employing weekly peak data and the weather variables of weekly maximum temperature and total precipitation for two distinct regions in the city of Nicosia, Cyprus. The authors developed and compared the relative performance of 20 MLR models and 60 neural network 2182 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Multilayer Perceptron (MLP) models using three different learning algorithms (Levenberg–Marquardt, resilient back- propagation and Powell Beale conjugate gradient methods). For the two regions analyzed, the method employ- ing the Levenberg–Marquardt algorithm presented the most accurate forecast of weekly peak demand. Fuzzy and neuro-fuzzy methods Altunkaynak et al. () used the Fuzzy Takagi–Sugeno (FTS) method to forecast monthly water demand in Istan- bul (Turkey). The method consists of using the water consumption values for the last three months as the inde- pendent variables. That is, water demand is presented as a function of demand ﬂuctuations during the last three months. The Adaptive Neuro-Fuzzy Inference System (ANFIS) method was used to determine the model par- ameters. The Mean Square Error (MSE) statistic for different method conﬁgurations was used to select the most effective method. The authors argue that this model is more widely used than the Markov or ARIMA methods, commonly available for stochastic modeling and forecast- ing. One of the advantages of using the FTS method, compared with ARIMA methods, is that it does not rely on stationary and ergodicity assumptions. Finally, this method also helps to make predictions with less than 10% relative error. Firat et al. (a) compared two types of Fuzzy Infer- ence System (FIS) to predict the time series of urban water demand. The Fuzzy Inference Systems used include an ANFIS system and a Mandami Fuzzy Inference System (MFIS). The performances of the ANFIS and MFIS methods were analyzed in the training and test stages. To evaluate the best forecasting method, the performances of the two methods, in both the training and testing stages of demand, were compared with the observed values. All levels of threshold statistics employed in the study demon- strated the higher accuracy of the M5-ANFIS model over the M5-MFIS model. The M5 model comprises a Fuzzy Inference System with ﬁve-month lags. Therefore, the results showed that the M5-ANFIS method is superior to the M5-MFIS method for forecasting monthly demand series, and can be applied successfully for predicting water consumption. Support Vector Machines Peña-Guzmán et al. () used the Least-Squares Support Vector Machine (LS-SVM) learning method to predict the monthly water demand for residential, industrial and com- mercial categories in Bogotá, Colombia. To do this, they used the parameters of monthly water demand, number of users and price, for residential, industrial and commercial categories. The city employs a system of socioeconomic stra- tiﬁcation, in accordance with the national laws on public services, where residential dwellings are classiﬁed into six strata. They used monthly records from January 2004 to December 2014. As proposed by Ghiassi et al. (), the researchers employed 80% training data and 20% test data. The LS-SVM method proved superior to the neural network method, using the method of error learning back- propagation, for all categories and strata. This proved to be an effective tool for the planning and management of water demand, as it helped to identify the need for adminis- trative decisions to regulate consumption in different strata and for different uses. Herrera et al. () described and compared various methods for predicting water demand in a city in the south of Spain. The methods used were: Support Vector Regression (SVR), FFNN employing the Error Backpropagation learning method, Projection Pursuit Regression (PPR), Multivariate Adaptive Regression Splines (MARS), and Random Forest (RF). In addition to these methods, researchers have proposed a simple method based on the demand proﬁle, using weighted results from exploratory data analysis (WPatt). The results obtained identiﬁed the SVR as the most accurate method, fol- lowed closely by the MARS, PPR and RF methods. Statistical methods The main objective of the study by Fullerton Jr et al. () was to analyze the dynamics of the water demand for the city of El Paso (Texas, USA), using several forecasting meth- odologies, among which was the Linear Transfer Function (LTF), which is an extension of the methodology described by Box & Jenkins (). The LTF result was superior when compared with the autoregressive vector (VAR), random walk (RW) and random walk with drift (RWD) methods. 2183 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 De Maria André & Carvalho () estimated the func- tion of residential water demand in the city of Fortaleza, Brazil, considering the potential impact of including spatial effects in the modeling since the exclusion of these effects underestimates the impact of income and the number of toi- lets on residential water demand marginal prices. First, these authors estimated an econometric method of water demand without taking spatial effects into account. This econometric method was calculated for the following speciﬁcations: aver- age price (model AP), marginal price with difference (model MP) and marginal price with difference using the McFadden method (McFadden model). Afterwards, they calculated three models to verify the inclusion of spatial effects on water demand: Spatial Error Model (SEM), Spatial Auto- regressive Model (SAR) and Spatial Autoregressive Moving Average Model (SARMA) were estimated using the follow- ing explanatory variables: average and marginal income gap, number of male and female residents, and number of bathrooms, under different spatial speciﬁcations. Results suggest that the SARMA provides the best results. However, these results contradict ﬁndings of Chang et al. () and House-Peters et al. (), who claim that the spatial approach provides more accurate results than the SARMA. After estimating the SARMA (both for the AP model and for the McFadden model), and correcting the direct and indirect effects of estimated parameters, it was concluded that the use of a spatial approach is more advantageous. Not including spatial effects on the variables caused an underestimation of the effect of all the variables in the model. After including these spatial components, the price elasticity in the AP and McFadden models increased by 24.66% and 13.32%, respectively, affecting forecast demand. Gagliardi et al. (), proposed a short-term water demand forecasting method based on the Markov Chain (MC) statistical concept, providing estimates for future demands and the probabilities that the forecast demand will fall within the expected variability. Two methods were proposed, one based on Homogeneous Markov Chains (HMC) and one based on Non-Homogeneous Markov Chains (NHMC). These methods were applied to three District Metered Areas (DMA) located in Yorkshire (UK), in order to predict water demands from 1 to 24 h later. Sub- sequently, the results were compared with the predictions of the two methods used as benchmarks (ANN, Naive Bayes). The results show that the HMC method provides more accu- rate short-term predictions than NHMC. Both methods provide probabilistic information on stochastic demand forecasting with reduced computational effort, as compared with most existing methods. This information is not readily available in either the ANN or Naive Bayes benchmark methods. However, it can be obtained through post-proces- sing analysis using Monte-Carlo simulations that are computationally more expensive. Hybrid methods The main factors that impact urban water demand are often difﬁcult to identify using traditional algorithms due to the many factors that are uncertain and difﬁcult to quantify. Some ﬁlters, wrappers and embedded systems may be employed to deal with this problem. Each one has strengths and weaknesses. Table 1 presents an overview of the main strengths and weaknesses of the three types of variable selection methods (de Freitas ). Methods for selection of variables are important in the improvement of forecasting models, increasing the efﬁciency of the process caused by the mitigation of the known curse of dimensionality (Guyon & Elisseeff ), reducing the com- putational cost (Piramuthu ) and obtaining a deeper insight into the underlying processes that generated the data (Saeys et al. ). Efﬁcient search strategies can be planned without necessarily sacriﬁcing predictive perform- ance (Guyon & Elisseeff ). Several selection strategies are being developed to minimize the computational load caused by exhaustive search, such as the work of Sorjamaa et al. () and Hsu et al. (). Recently, hybrid approaches have been proposed to combine the advantages of ﬁlters and wrappers (Crone & Kourentzes ; Stan´czyk ). Table 1 | Comparison of methods for selection of variables Types Strengths Weaknesses Filter Rapid execution and robustness to data overﬁt Redundant variables selection Wrapper High precision Slow execution and data overﬁt Embedded Combination of ﬁlters and wrappers Preliminary knowledge for variable selection 2184 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Another aspect of research concerns learning using an ensemble, where the methods that generate several models are combined to predict a new case. The idea of these methods can be described as the construction of a predictive model through the integration of multiple methods (Dietterich ). One of the advantages is the improvement of generalization performance (Hansen & Salamon ; Sharkey ; Zhang ; Melin et al. ). However, such improvement relies on the quality of its components and the diversity of the error presented by them (Granger ; Perrone & Cooper ; Krogh & Vedelsby ; Sollich & Krogh ; Granitto et al. ; Gashler et al. ; Al-Zahrani & Abo-Monasar ; Ren et al. ; Wang et al. ), that is, each of the components in an ensem- ble should perform well and at the same time should generalize differently. It makes little sense to combine methods that adopt the same procedures and hypotheses for solving a problem (Perrone & Cooper ). If com- ponents that have the same error pattern are combined, there will be no incremental performance, only an increase of computational cost, without practical performance results. According to Mendes-Moreira et al. (), the generation of homogeneous ensembles is the area of learning with better coverage in the literature. In homogeneous ensembles, models are generated using the same algorithm. Hetero- geneous ensembles are generated using more than one machine learning algorithm. It is expected that the hetero- geneous approach can obtain models with greater diversity due to the different nature of the basic apprentices (Webb & Zheng ). Some authors claim that these ensembles per- form better when compared with homogeneous ensembles (Granger ; Krogh & Vedelsby ; Wichard et al. ). Another approach, usually employed, is the one that combines the use of different induction algorithms merged with different sets of parameters (Rooney et al. ). The most widely known ensemble methods are the Bag- ging (Bootstrap Aggregating) introduced by Breiman (), Boosting (Freund & Schapire ) and Random Forest (Breiman ). Filter Xu et al. () used the energy spectrum (Oshima & Kosuda ) and the largest Lyapunov coefﬁcient (Tsonis ) to qualitatively examine the characteristics of the time series of water demand. Results indicate that the water demand time series presents characteristics of chaos, i.e., an upward trend of the time series is observable, but the evolution law and variation characteristics of the data cannot be determined easily. Results are similar to those obtained by Zhao & Zhang () and Bai et al. (). Thus, the problems of predicting water demand can be trans- lated into problems of forecasting chaotic series. Therefore, pre-processing to improve the accuracy of the results is necessary. In the ﬁltering procedure, set selection is a data pre-pro- cessing step, regardless of the induction algorithm. The ﬁlter is usually robust to data overﬁt, but fails to ﬁnd the most promising subset of variables (de Freitas ), on average. The main weakness of this approach is that it ignores the effects of the selected subsets on the performance of the induction algorithm (John et al. ; Kohavi & John ). In the literature, several types of ﬁlters are used: (i) Step- wise Regression is used to identify signiﬁcant delays of the autoregressive component of the dependent variable as inputs to an MLP (Dahl & Hylleberg ); (ii) Spectral Analysis is used to evaluate the cyclic data patterns, decom- posing the time series into the underlying sine and cosine functions of the wavelengths (Kay & Marple ); (iii) Singular Spectrum Analysis (Hassani ; Du et al. ); (iv) Empirical Mode Decomposition (EMD) with time frequency resolution by which steady behavior and non- linear behavior of time series can be decomposed (Di et al. ; Shabri & Samsudin ); and (v) Kalman ﬁlter (Poli & Jones ; Nasseri et al. ; Arandia et al. ; Karunasingha & Liong ) and Hodrick–Prescott ﬁlter (Wu & Zhou ). It is worth mentioning that according to Zhang & Qi (), machine learning methods, without proper pre- processing, can become unstable and generate suboptimal results. Wrappers Wrappers, popularized by John et al. () and Kohavi & John (), provide a simple and powerful way to address the problem of variable and/or attribute selection, regardless of the learning machine to be employed. According to 2185 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 de Freitas (), the strength of this method is that it takes into account the bias of the induction algorithm and considers the variables in-context. At ﬁrst, the search is exponential, but it is possible to implement stochastic searches (e.g., genetic algorithms and simulated annealing) or sequential ones (e.g., direct search and backward deletion). Therefore, there are numerous possibilities to be studied empirically. Embedded In the embedded model, the task of selecting attributes is dynamically performed by the machine learning algorithm. The attribute selection process is not distinct from the train- ing of the model, and the results are calibrated in relation to a given classiﬁer or speciﬁc regressor. For Zanchettin (), one of the strengths of this approach is that it makes the best use of the available data, i.e., does not have to divide it into training and test data, and is faster because it does not require multiple trainings. Hybrid models with coupled ﬁlters A hybrid model that combines Extended Kalman Filter (EKF) and Genetic Programming (PG) was proposed by Nasseri et al. () to predict monthly water demand. According to Nasseri et al. () GP is a symbolic regression method based on a tree-structured approach presented by Koza (). This method belongs to a branch of the evol- utionary method, which mimics the natural process of the struggle for existence (Holland ). The main advantage of the proposed approach is the possibility of achieving the fewest non-linear and deterministic mathematical formu- lations for monthly water demand forecasting, via the evolutionary method. The results obtained using the EKF- PG and PG hybrid models showed a noticeable effect on the accuracy of the forecast. Adamowski et al. () conducted daily water demand forecasts for the summer months in the Canadian city of Montreal. They employed a hybrid method based on Dis- crete Coupling Wavelet Transforms (W) and Artiﬁcial Neural Networks. The W-ANN hybrid models were com- pared with ANN, MLR, Multiple Non-Linear Regression (MNLR) and ARIMA methods to predict a one-day lead time. The results indicate that the W-ANN were more robust than all other methods, suggesting the promising poten- tial of this method for predicting urban water demand. According to the authors, the accuracy of the W-ANN predic- tion maybeusefulinthe management,planningand evaluation of existing systems, conservation initiatives, analysis of drought conditions and water pricing policies. Odan & Reis () aimed to identify a method that best ﬁtted the hourly consumption data for a given supply zone in the city of Araraquara (Brazil). Before using the observed values, the procedure of pre-processing missing data resulting from record failures, or the presence of values higher or lower than twice the absolute value of the standard deviation, was used. The pre-processing method used was the Bayesian Principal Component Analysis (BPCA) developed by Oba et al. ().This method is based on a principal component regression, Bayesian estimation, and a repetitive expectation–maximi- zation algorithm. The method uses an iterative variant Bayesian algorithm to estimate the posterior distribution of the model parameters and the defective data, until their convergence. According to the researchers, the pre- processing technique achieved good results, even when 40% of the data are missing, thus exceeding the perform- ance of the models based on K-Nearest Neighbors (K-NN) and Singular Value Decomposition (SVD). After completion of the pre-processing, correlation analysis was employed to identify the input variables (temperature, relative humidity, time consumption and reservoir level). It was observed that the inclusion of climatic variables (temperature and relative humidity) improved the demand forecasting. The time of consumption was con- sidered as variable in the correlation analysis, due to the cyclical water consumption throughout the day. This study addressed the problem of real-time WSS prediction using ANN, DAN2 and the hybrid models ANN-H and DAN2-H. Both the ANN-H and DAN2-H hybrid models use the error produced by the Fourier series prediction as inputs, thus achieving promising results. The DAN2-H hybrid model presented the best results, both for the hourly and the daily forecasts. According to Liu et al. (), the main factors that impact urban water demand patterns are often difﬁcult to identify, employing traditional algorithms, due to numerous uncertain factors and difﬁculties in quantiﬁcation. In order 2186 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 to get around this problem, researchers have proposed an improved attribute reduction algorithm based on the cumu- lative weighting mean C-Fuzzy (FCM). This algorithm was used to analyze the main factors that impact the pattern of daytime water demand in the city of Hangzhou (China). The data used in this study included minimum, mean and maximum daily temperature, daily precipitation, day of the week or weekend, and daytime water demand pattern. Later, they used SVR to evaluate the inﬂuence of the main factors on the prediction of the diurnal pattern of water demand. The best performing model included minimum and maximum daily temperature, and day of the week. According to the researchers, this algorithm proved to be an effective and feasible method for solving the cluster pro- blem of consecutive curves, as in the daytime water demand pattern. Recently, Tiwari & Adamowski () performed weekly and monthly forecasts of water demand in the city of Cal- gary (Canada). The method used in their study was the hybrid Wavelet-Bootstrap Artiﬁcial Neural Network (WB- ANN). The use of this method aimed to improve the accu- racy and reliability of demand forecasting, incorporating Wavelet processing capacity and Bootstrap (B) analysis using artiﬁcial neural networks. This method was then com- pared with the standard ANN, ANN based on Bootstrap (B-ANN) and based on W-ANN. For prediction of weekly and monthly peaks, the WB-ANN and W-ANN hybrid methods were found to be more accurate when compared with the B-ANN and ANN methods. The results of the fore- casts using the WB-ANN hybrid methods and W-ANN were very effective in predicting water demand peaks. This indi- cates that Wavelet analysis signiﬁcantly improved the performance of the method, while the Bootstrap technique improved the reliability of the forecasts. Another point highlighted by the researchers is the effectiveness of the methodology in situations with limited data availability. Due to the difﬁculty of modeling water demand time series using traditional statistical methods, Shabri & Samsu- din () proposed a hybrid model that combines the Empirical Mode Decomposition (EMD) method proposed by Huang et al. (), and the Least-Squares Support Vector Machine (LS-SVM) method to predict water con- sumption. EMD was used to decompose the non-linear and non-stationary series of water demands into various components of Intrinsic Mode Functions (IMF) and a residual component. The LS-SVM algorithm was built to predict these intrinsic and residual components individually, which were later aggregated to produce the expected ﬁnal value. The empirical results indicate that the proposed method outperforms the single LS-SVM method and the ANN, without EMD pre-processing, and EMD-ANN method. Tiwari et al. () used the newly developed Extreme Learning Machines (ELM) method, either alone or together with wavelet analysis (W) or Bootstrap (B) methods, to fore- cast daily water demand in the city of Calgary, Canada. Subsequently, they were evaluated and compared with equivalent methods based on traditional ANN (i.e., ANN, W-ANN, B-ANN). The B-ELM and B-ANN hybrid methods provided similar accuracy in the predictions on peak days. However, the W-ANN and W-ELM methods provided higher accuracy, with the W-ELM method surpassing the W-ANN method. The superiority of the W-ELM method over the traditional methods (W-ANN or B-ANN) demon- strates the importance of wavelet transformation in urban water demand forecast modeling. This highlights the ability of wavelet transformation to decompose time series with non-stationary behavior into discrete components, highlight- ing the cyclical patterns and trends. Arandia et al. () presented a methodology for predicting water demand for the short term through the combination of autoregressive components, moving averages, integration ﬁlter and seasonal terms added to the ARIMA method (SARIMA). According to Caiado (), this method has not received much attention for predicting water demand despite its parsimony qualities and the ease of interpretation of its parameters in explicit function of mathematical formulations. For Arandia et al. (),ofﬂine mode is best suited for utility operations (such as daily water production sizing), while online mode may be more appro- priate for other operations (such as pump scheduling). In ofﬂine mode, the method employs the re-estimated models using more recent historical data. In online mode, the method applies the Kalman ﬁlter in order to update and optimize the models using real-time ‘feed’ data. Three quali- tatively different sets of data were modeled. Structures and sample size estimation of data used for training were ident- iﬁed. These models were applied to anticipate demands for 2187 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 24 hours in advance using ofﬂine and online modes. Subsequently, results were analyzed and compared and demonstrated the application of the method in the forecast of daily water production using SARIMA methods. Unlike the ANN methods, or other methods known as ‘black box’, the SARIMA methodology can be shaped in the form of a state-space model, identifying the most appropriate parametric structures for water demands with time resol- utions varying from hourly to daily. Hybrid models with multiple methods employed Pulido-Calvo & Gutiérrez-Estrada () proposed a hybrid model using Neural Networks, Fuzzy Inference and Genetic Algorithms to predict the daily water demand in the irriga- tion district of Andalusia in southern Spain. ANN methods were trained using the Extended-Delta-Bar-Delta (EDBD) algorithm (Pulido-Calvo et al. ) and, subsequently, recalibrated with a variation of the Error Backpropagation algorithm known as Levenberg–Marquardt (Shepherd ). According to Wilamowski & Yu (), the Levenberg–Marquardt algorithm is currently one of the most efﬁcient for training artiﬁcial neural networks, especially when they involve long time series. The results obtained using the hybrid model indicated that it is superior to autoregressive, univariate and multivariate ANN methods. Therefore, the hybrid model is a very powerful tool for devel- oping appropriate policies on irrigation water consumption. Caiado () analyzed the performance of demand fore- casting in Spain using the univariate exponential smoothing methods of Holt–Winters (HW), ARIMA and Generalized Autoregressive Conditional Heteroscedasticity (GARCH), for one to seven steps ahead. According to the author, the combination provides more accurate predictions than indi- vidual methods. Predictions can be combined using either a simple or a weighted average. All possible combinations of the Holt–Winters, ARIMA and GARCH prediction methods were considered, using the simple average of fore- casts for one to seven steps (days) ahead. To calculate the ideal weights, the author considered two approaches. First, the weights were proportional to the inverse MSE of each individual method (Makridakis & Winkler ). Second, the weights were proportional to the inverse of the predic- tion square errors (PSE) of each individual method. If the performance of individual methods changes during the fore- cast period, combining predictions with the use of inverse PSE weights may result in more accurate predictions than the method that uses MSE inverse weights. The results indi- cate that the combination of forecasts can be very useful, especially for short-term forecasts. However, the perform- ance of this approach is not consistent over the seven days of the week. On the other hand, individual predictions of HW and GARCH methods can improve prediction accuracy on speciﬁc days of the week. Azadeh et al. () presented a hybrid approach, using ANN and Fuzzy Linear Regression (FLR), to improve water demand forecasting. According to the researchers, this approach can be easily applied in uncertain or complex environments, given its ﬂexibility. Their proposed hybrid approach was applied to predict daily water demand in Tehran (Iran). The variables used were the daily maximum temperature, the maximum temperature predicted for the following day, the precipitation index and the demand on hot days and cold days. Results indicated that ANN outper- formed FLR on hot days due to its ability to deal with complexity and non-linearity. However, both ANN and FLR were ideal on cold days. According to Al-Zahrani & Abo-Monasar (), cli- matic factors play a fundamental role in predicting short- term water demand since they have a direct inﬂuence on water consumption. Their study was conducted in the city of Al-Khobar, Saudi Arabia, and employed climatic humid- ity and temperature parameters (minimum, average and maximum), rainfall intensity, occurrence of rainfall and wind speed associated with historical daily water consump- tion. In this study, the potential of hybrid models, for the daily water demand forecast, was investigated by coupling Time Series to Artiﬁcial Neural Networks (TS-GRNN). Results indicated that the TS-GRNN hybrid models provide better predictions when compared with ANN or TS methods alone. According to the authors, the results indi- cate that temperature is the most important meteorological predictor in the neural network training. Humidity, wind speed and the occurrence of rain also proved to be impor- tant, but cannot be used without temperature. On the other hand, rainfall intensity is the parameter that makes the smallest contribution to the capacity of the model for predicting water demand, during the ANN training process. 2188 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Hybrid models with embedded signal processing Bai et al. () proposed a Multi-Scale Relevance Vector Regressor (MS-RVR) approach for predicting daily water demand in the city of Chongqing (China). This method is a hybrid that combines the RVR and the multiscale analysis of the Wavelet. The coefﬁcients of the Wavelet, of all scales obtained, were used to train a machine learning model using the Relevance Vector Regression (RVR) method. Sub- sequently, the estimated coefﬁcients of the RVR were used to generate forecasting results through the inverse wavelet transform. In order to facilitate the prediction of MS-RVR, the chaotic characteristics of the daily series of water supply were analyzed using the Adaptive Chaos Particle Swarm Optimization (ACPSO) algorithm to determine the optimal combination of RVR method input variables. Finally, the researchers compared the results of the best MS-RVR method with two recent methods proposed by Firat et al. (), called GRNN and FFNN, using the same data set and using the same accuracy criteria. Results show the proposed MS-RVR method to be much more precise. On-line modeling in water distribution systems According to Kapelan (), numerous mathematical methods are used to describe the behavior of WDS. According to Gupta et al. (), some methods belong to a group of intrinsically intractable problems commonly referred to as NP-hard. To have meaningful use, a WDS mathematical model must ﬁrst be calibrated (Kapelan ). This calibration is deﬁnedasaprocessin which sev- eral WDS model parameters are adjusted until the model mimics the actual WDS behavior as closely as possible. WDS hydraulic model calibration is enhanced by the appli- cation of appropriate optimization methods. Recently, the application of nature-based stochastic optimization tech- niques, such as GA, has expanded. According to Broad et al. (), GA demonstrated its applicability in the optimization of WDS operations by minimizing the cost subject to hydraulic constraints. Moreover, according to Broad et al. (), the focus of optimization has expanded to include issues related to water quality, generating additional complexity and increasing computational overhead. The real-time modeling of WDS, according to Hutton et al. (), often neglects the multiple sources of system uncertainty, thus affecting the identiﬁcation of robust operational solutions. In order to minimize such a gap, these authors provide a critical review of various methods applied in the quantiﬁcation and reduction of uncertainty at each stage of cascade modeling, ranging from calibration through data assimilation to model predic- tion. This review also includes promising methods to address the uncertainty of the applied model in related scientiﬁc ﬁelds and considers key issues that govern its application in WDS control. Odan () implemented the Multi-Algorithm Geneti- cally Adaptive Method (AMALGAM) integrated to the hydraulic simulator (EPANET 2) and the Neural Network Dynamics method (DAN2-H). The study was carried out in the city of Araraquara (Brazil). The method was applied in three different sectors (Eliana, Iguatemi and Martinez) and the resulting operational strategies yielded reductions of 14%, 13% and 30%, respectively, in the cost of electricity consumption. This optimization method has proven to be a robust and efﬁcient tool. Xu et al. () used the energy spectrum (Oshima & Kosuda ) and the largest Lyapunov exponent (Tsonis ) to qualitatively examine the characteristics of the time series. Their results indicate that the time series of water demand presents chaotic characteristics. The results are in agreement with those obtained by Zhao & Zhang (); the results of Bai et al. () were similar as well. Therefore, the problems of predicting water demand can be translated into problems of forecasting chaotic series. Romano & Kapelan () presented an innovative methodology to predict water demand for up to 24 hours, aiming to support operational management in near-real- time water distribution systems. The methodology is based solely on the analysis of time series of water demand (esti- mated by mass balance analysis), using Evolutionary Artiﬁcial Neural Networks (E-ANN). The Demand Forecast- ing System (DFS) main features include continuous adaptability to changing water demand patterns, generic applicability and transparency for different signals of demand, drastic reduction in required, human expert effort in the projection of an ANN method, and feasibility of implementing this methodology in an online environment. 2189 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 The DFS consists of four main components: (i) the data pre-processing module; (ii) the ANN optimization module; (iii) the ANN construction module; and (iv) the Water Demand Forecasting module (WDF). For the speciﬁc demand signal being analyzed, the data pre-processing module prepares the raw data to facilitate/improve the pro- cess of constructing the E-ANN method and thus obtain a more accurate WDF. The DFS allows the application of two alternative approaches to water distribution systems. The ﬁrst model (pE-ANN) uses many E-ANN models in par- allel to predict the demands, separately, for different times of day. The second model (rE-ANN) uses a recursively hourly forecast horizon to predict the demands. Both approaches have been used and tested for three DMA and a Water Supply Zone (WSZ) of Yorkshire Water Services (YWS) covering signiﬁcant parts of two cities in Yorkshire County, in the UK. According to the researchers, this new methodology allows more accurate predictions to be gener- ated, thus demonstrating the potential for providing substantial improvements to the state of the art in the man- agement of intelligent water distribution systems, in near- real time. The performances of the predictions were evalu- ated in terms of Nash–Sutcliffe index (NSI), the mean square error (MSE) and mean absolute percentage error (MAPE). Results showed that, regardless of the approach used, the multiple E-ANN models slightly surpass the single E-ANN model in terms of accuracy in predicting water demand. According to Herrera et al. (), the use of SVR is one of the best machine learning options for short-term demand forecasting. Therefore, Brentan et al. () proposed an on- line hybrid model applying SVR and Adaptive Fourier Series (AFS) to improve prediction. The study was carried out in the municipality of Franca (Brazil), in which data on water demand from residential consumers, temperature, humidity, precipitation and wind speed were used. Table 2 summarizes the information about the use of water demand forecasting methods. DISCUSSION The literature review shows that in the context of water demand forecasting, several SC methods have been studied and applied to deal with problems of precision, stochasticity and non-linearity (Bonissone ). This makes predicting the demand for water a very difﬁcult task. In this sense, the SC methods (fuzzy logic, neural computation, genetic algorithms, evolutionary computation, machine learning and hybrid systems that use such complementarity) contrib- uted a great deal to the methodological advances in urban water demand forecasting. According to Bates & Granger (), the possibility of increasing the precision of the prognostics beneﬁts from the complementarity of the infor- mation contained in each individual forecast. This results from the proposition that the expected variance of the errors of the combined forecast is less than the smallest of the variances of the individual forecasts. Each of these methods provides additional tools, trying to solve complex real-world problems. However, a closer look at the revised literature and recent advances in SC methods suggest that there is still room for improvement in predicting water demand. For neural networks, these can be divided into several types of architecture. However, there are few methods used to predict water demand (Ghalehkhondabi et al. ). An extensive literature review revealed that only a small number of architectures were employed to predict urban water demand. The most used architecture in predict- ing urban water demand is the FFNN, also known as MLP. References to the RBNN (Broomhead & Lowe ), Probabilistic Neural Network (PNN) (Specht ), and ELM (Huang et al. ) were also found. However, no studies using the architecture of Recurrent Neural Networks such as Hopﬁeld (Hopfield ), Jordan (Jordan ), Totally Recurrent Neural Networks (FRNN) (Williams & Zipser ), Elman Networks (Elman ), Local Recur- rent Global Feedforward (LRGF) (Tsoi & Back ), Long Short-Term Memory (LSTM) and Echo State Neural Network (ESNN) ( Jaeger ) were found to predict water demand. Recent advances in neural networks, such as the Convo- lutional Neural Network (CNN or ConvNet), have not been used to predict urban water demand, opening up a promis- ing space for this problem. Recently, Borovykh et al. () developed a deep convolutional neural network for predict- ing multivariate time series, based on the recent WAVENET architecture developed by van den Oord et al. ().In 2190 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022Table2|WaterdemandforecastingmethodsaccordingtothereferencedliteratureAuthorsCity/CountryEmployedvariableForecasthorizonMeasuresofaccuracyMethodsemployedAdamowski&Karapataki()Nicosia/CyprusTemperature,precipitation,demandWeeklyR2,RMSE,AARE,maxARE,PIArtiﬁcialNeuralNetworks,MultipleRegression(MLR)Adamowskietal.()Montreal/CanadaTemperature,precipitation,demandDailyR2,NSI,RMSE,RRMSEWaveletArtiﬁcialNeuralNetworks(W-ANN),AutoregressiveIntegratedMovingAverage(ARIMA),MultipleRegression(MLR),Non-LinearRegression(MNLR)Altunkaynaketal.()Istanbul/TurkeyDemandMonthlyARE,RMSEFuzzyInference(ANFIS,MFIS,FTS),AutoregressiveIntegratedMovingAverage(ARIMA)Al-Zahrani&Abo-Monasar()AlKobar/SaudiArabiaTemperature,precipitation,relativehumidity,windspeed,demandDailyMAPE,R2ArtiﬁcialNeuralNetworks(ANN):GRNN,TS-GRNNAzadehetal.()Tehran/IranTemperature,precipitation,demandDailyMAPEArtiﬁcialNeuralNetworks(ANN),FuzzyLinearRegression(FLR)Baietal.()Chongqing/ChinaDemandDailyMAPE,NRMSE,RMulti-ScaleRelevanceVectorRegression(MS-RVR),ArtiﬁcialNeuralNetworks(ANN):GRNN,FFNNBrentanetal.()Franca/BrazilTemperature,precipitation,relativehumidity,windspeedDailyRMSE,MAE,R2SupportVectorRegression(SVR),SupportVectorRegressionAdaptiveFourierSeries(SVR-AFS)Caiado()SpainDemandDailyMSEAutoregressiveIntegratedMovingAverage(ARIMA),Holt–Winters,GeneralizedAutoregressiveConditionalHeteroscedasticity(GARCH)Firatetal.(a)Izmir/TurkeyDemandMonthlyNRMSE,AARE,TSFuzzyInference:ANFIS,MFISFiratetal.(b)Izmir/TurkeyPopulation,numberofhouseholds,grossnationalproduct,temperature,precipitation,humidity,inﬂation,demandMonthlyNRMSE,R,NSIArtiﬁcialNeuralNetworks(ANN):GRNN,FFNN,RBNNFiratetal.()Izmir/TurkeyDemandMonthlyNRMSE,R,NSIArtiﬁcialNeuralNetworks(ANN):GRNN,CCNN,FFNNFullertonetal.()ElPaso/USAWaterdemandpercustomer,realaveragerevenueprice,numberofcustomers,daysover32\u0001C,totalmonthlyprecipitation,non-seasonallyadjustednon-farmemploymentMonthlyHMp-value,U-statisticLinearTransferFunction(LTF)ARIMA,VectorAutoregression(VAR),RandomWalk(RW),RandomWalkwithDrift(RWD)(continued) 2191 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdfby Zhejiang University useron 17 January 2022Table2|continuedAuthorsCity/CountryEmployedvariableForecasthorizonMeasuresofaccuracyMethodsemployedGagliardietal.()YorkshireCounty/UnitedKingdomDemandHourlyNSIMLP,NB,HMC,NHMCGhiassietal.()SanJoseandsurroundingcitiesofCampbell,Cupertino,LosGatos,MonteSerenoandSaratoga/USAVolumepumpedHourly,daily,weekly,monthlyMAPEAutoregressiveIntegratedMovingAverage(ARIMA),ArtiﬁcialNeuralNetwork(DAN2)Herreraetal.()SpainTemperature,windspeed,atmosphericpressure,precipitation,demandHourlyRMSE,MAE,NSIArtiﬁcialNeuralNetworks:FFNN,PPR,MARS,SVR,RF,WPattLiuetal.()Hangzhou/ChinaMinimum,maximumandaveragedailytemperature,dailyindexofweatherconditions,precipitation,weekdayorweekend,demandHourlyAARESVRdeMariaAndré&Carvalho()Fortaleza/BrazilPrice,marginalprice,averageprice,income,numberofbathrooms,garden/landcoverarea,typeofresidence,sexMonthlyR2,LM,MoranISpatialmodels(SEM,SAR,SARMA)Nasserietal.()Tehran/IranDemandMonthlyR2,NMSEGeneticProgramming(GP),EKFPGOdan&Reis()Araraquara/BrazilTemperature,relativehumidity,demandHourlyMAE,RArtiﬁcialNeuralNetworks(ANN):DAN2,DAN2-H,ANN,ANN-HPeña-Guzmánetal.()Bogotá/ColombiaDemand,numberofusers,priceMonthlyRMSE,R2,AARELS-SVM,ArtiﬁcialNeuralNetworks(ANN):FFNNPulido-Calvo&Gutiérrez-Estrada()Córdoba/SpainDemandDailyR,R2,RMS,SEP,NSI,PIArtiﬁcialNeuralNetworks(ANN):FFNN-EDBD,FFNN-LM,FFNN-EDBDFUZZY,FFNN-EDBDFUZZYRomano&Kapelan()YorkshireCounty/UnitedKingdomDemandTime,dailyMSE,MAPE,NSIArtiﬁcialNeuralNetworks(ANN):E-ANNShabri&Samsudin()BatuPahat/MalaysiaDemandMonthlyMAE,RMSE,RLS-SVM,EDM-LS-SVM,ArtiﬁcialNeuralNetworks(ANN):ANN,EDM-ANNTiwari&Adamowski()Calgary/CanadaTemperature,precipitation,demandDaily,monthlyR2,RMSE,MAE,PI,PdvArtiﬁcialNeuralNetworks(ANN):B-ANN,W-ANN,WB-ANNTiwarietal.()Calgary/CanadaTemperature,precipitation,demandDailyR2,RMSE,MAE,PI,PdvArtiﬁcialNeuralNetworks(B-ANN,W-ANN,WB-ANN),ExtremeLearningMachines(ELM,W-ELM,B-ELM) 2192 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdfby Zhejiang University useron 17 January 2022 addition, according to Qiu et al. (), deep learning methods have proven to be highly promising in various areas of prediction. Also, in relation to the neural networks, the number of hidden layers and the algorithms used in training can affect ANN performance. Finding the best architecture can be a difﬁcult task, and FFNN may not always be the best method or provide the best results (Herrera et al. ). Other algorithms such as Dynamic Gaussian Bayesian Net- work (DGBN) (Froelich ) and ELM have been researched and developed to optimize predictions based on neural networks (Tiwari et al. ). This literature review shows that studies are more focused on the operating system of management (short term), according to the classiﬁcation proposed by Gardiner & Herrington () and used by Donkor et al. (). There are very few studies that address medium- and long-term forecasting. A possible explanation may be associated with the inadequacy of the basic ANN architecture, such as FFNN, to deal with noisy data (Ghalehkhondabi et al. ), limiting its application to less complex and linearly inseparable patterns. There are also certain types of patterns in the time series of water demand, which have a great need for pre-processing. In order to improve prediction accuracy, researchers began to develop hybrid methods based on wavelet and bootstrap coupling (Adamowski et al. ; Tiwari & Adamowski ; Tiwari et al. ; Altunkaynak & Nigussie ; Chen et al. ; Du et al. ). These methods were more robust in prediction, compared with the FFNN, RLM, Non-Linear Regression Multiple (NLRM) and ARIMA regression, indicating that the wavelet trans- form signiﬁcantly improved the performance of the methods, highlighting their processing capacity in discrete and non-steady-state decomposition of time series com- ponents. It also highlights cyclical patterns and trends, while the bootstrap technique has improved forecast reliability, suggesting a promising potential of this hybrid method to predict urban water demand. In relation to the hybrid models, we highlight the Time Delayed Neural Network (TDNN) (Htike & Khalifa ), ANN with Fuzzy (Araujo et al. ), Local Feedback Dynamic Neural Network (LF-DFNN) (Barbounis & Theocharis ), Neuro-Fuzzy (ANFIS) ( Jang , ), ARIMA-ANN (Zhang ), ARIMA-SVR (Chen ) combination of methods ARIMA-HW-GARCH (Caiado ) and Continuous Deep Belief Neural Network (CDBNN) (Xu et al. ). The metaheuristic research line has great potential of application in water demand forecasting. However, there are few studies using genetic programming, such as Pulido- Calvo & Gutiérrez-Estrada () and Nasseri et al. (). Odan () has already used the AMALGAM optimization method and, more recently, Bai et al. () used the ACPSO. Other metaheuristics, such as the Ant Colony Optimization (ACO) method (Colorni et al. ), Agile Adaptive Randomization (GRASP) procedures (Feo & Resende ), and Genetic Simulated Annealing Algorithm (GSAA), can also be employed. FINAL CONSIDERATIONS In this work, an extensive review on urban water demand forecasting employing artiﬁcial intelligence was presented in order to provide some guidance regarding methods and models to professionals in sanitation companies. This article should be used to address short-, medium- and long-term planning decisions, and by researchers that have the goal of improving the models. This review shows that the studies are, mostly, focused on the management of the operating systems. There is, therefore, room for long-term forecasts and support for the development of master plans. It is worth mentioning that there is no global model, i.e., one soft computing method that outperforms all methods in all cases. Each region should be studied separately, seeking to add the strengths of each model, or combination of models, or choosing a more appropriate model for a given occasion. Another point concerns the robustness of the per- formance of the models. The results indicate that hybrid and innovative models showed superior results, when compared with the classical models analyzed. Although major advances in soft computing methods have been made recently, no new method, such as deep neural networks, among others, has emerged as the best forecasting approach. Therefore, water demand forecasting still remains a research problem, which leaves room for researchers to develop hybrid or speciﬁc methods for speciﬁc applications. 2193 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 The use of statistical applications of Machine Learning and Artiﬁcial Intelligence methodologies in water demand forecasting has grown considerably in recent years. Never- theless, there is still room for improvement with regard to water demand forecasting. REFERENCES Adamowski, J. & Karapataki, C.  Comparison of multivariate regression and artiﬁcial neural networks for peak urban water-demand forecasting: evaluation of different ANN learning algorithms. Journal of Hydrologic Engineering 15 (10), 729–743. doi:10.1061/_ASCE_HE.1943-5584.0000245. Adamowski, J., Chang, H. F., Prascher, S. O., Ozga-zielinski, B. & Sliusarieva, A.  Comparison of multiple linear and nonlinear regression, autoregressive integrated moving average, artiﬁcial neural network, and wavelet artiﬁcial neural network methods for urban water demand forecasting in Montreal, Canada. Water Resources Research 48, W01528. doi:10.1029/2010WR009945. Altunkaynak, A. & Nigussie, T. A.  Monthly water consumption prediction using season algorithm and wavelet transform-based models. Journal of Water Resources Planning and Management 143 (6), 04017011. doi:10.1061/(ASCE)WR.1943-5452. 0000761. Altunkaynak, A., Özger, M. & Çakmakci, M.  Water consumption prediction of Istanbul city by using fuzzy logic approach. Water Resources Management 19, 641–654. doi:10.1007/s11269-005-7371-1. Al-Zahrani, M. A. & Abo-Monasar, A.  Urban residential water demand prediction based on artiﬁcial neural networks and time series models. Water Resources Management 29, 3651–3662. doi:10.1007/s11269-015-1021-z. Arandia, E., Ba, A., Eck, B. & McKenna, S.  Tailoring seasonal time series models to forecast short-term water demand. Journal of Water Resources Planning and Management 142 (3), 04015067. doi:10.1061/(ASCE)WR.1943-5452.0000591. Araujo, R., Valença, M. & Fernandes, S.  A new approach of fuzzy neural networks in monthly forecast of water ﬂow. In: Advances in Computational Intelligence, Vol. 9094 (I. Rojas, G. Joya & A. Catala, eds), IWANN 2015, Lecture Notes in Computer Science, Springer, Cham, Switzerland, pp. 576–586. https://doi.org/10.1007/978-3-319-19258-1_47. Arbués, F., García-Valiñas, M. Á. & Martínez-Espiñeira, R.  Estimation of residential water demand: a state-of-the-art review. The Journal of Socio-Economics 32,81–102. Azadeh, A., Neshat, N. & Hamidipour, H.  Hybrid fuzzy regression–artiﬁcial neural network for improvement of short-term water consumption estimation and forecasting in uncertain and complex environments: case of a large metropolitan city. Journal of Water Resources Planning and Management 138 (1), 71–75. https://doi.org/10.1061/(ASCE) WR.1943-5452.0000152. Bai, Y., Wang, P., Li, C., Xie, J. & Wang, Y.  A multi-scale relevance vector regression approach for daily urban water demand forecasting. Journal of Hydrology 517, 236–245. doi:10.1016/j.jhydrol.2014.05.033. Barbounis, T. G. & Theocharis, J. B.  A locally recurrent fuzzy neural network with application to the wind speed prediction using spatial correlation. Neurocomputing 70 (7–9), 1525–1542. https://doi.org/10.1016/j.neucom.2006.01.032. Bates, J. M. & Granger, C. W. J.  The combination of forecasts. Operations Research Quarterly 20 (4), 451–468. doi:10.2307/ 3008764. Bonissone, P. P.  Soft computing: the convergence of emerging reasoning technologies. Soft Computing 1,6–18. https://doi.org/10.1007/s005000050002. Borovykh, A., Bohte, S. & Oosterlee, C. W.  Conditional time series forecasting with convolutional neural networks. arXiv:1703.04691. https://arxiv.org/pdf/1703.04691.pdf. Box, G. E. P. & Jenkins, G. M.  Time Series Analysis: Forecasting and Control, 2nd edn. Holden-Day, San Francisco, CA, USA. Breiman, L.  Bagging predictors. Machine Learning 24 (2), 123–140. https://doi.org/10.1023/A:1018054314350. Breiman, L.  Random forests. Machine Learning 45 (1), 5–32. doi:10.1023/A:1010933404324. Brentan, B. M., Luvizotto Jr, E., Herrera, M., Izquierdo, J. & Pérez- García, R.  Hybrid regression model for near real-time urban water demand forecasting. Journal of Computational and Applied Mathematics 309, 532–541. doi:10.1016/j.cam. 2016.02.009. Broad, D. R., Dandy, G. C. & Maier, H. R.  Water distribution system optimization using metamodels. Journal of Water Resources Planning and Management 131 (3), 172–180. doi:10.1061/(ASCE)0733-9496(2005)131:3(172). Broomhead, D. S. & Lowe, D.  Multivariable functional interpolation and adaptive networks. Complex Systems 2, 321–355. Caiado, J.  Performance of combined double seasonal univariate time series models for forecasting water demand. Journal of Hydrologic Engineering 15 (3), 215–222. https:// doi.org/10.1061/(ASCE)HE.1943-5584.0000182. Chang, H., Parandvash, G. H. & Shandas, V.  Spatial variations of single family residential water consumption in Portland, Oregon. Urban Geography 31, 953–972. doi:10. 2747/0272-3638.31.7.953. Chen, K.-Y.  Combining linear and nonlinear model in forecasting tourism demand. Expert Systems with Applications 38 (8), 10368–10376. https://doi.org/10.1016/j.eswa.2011.02.049. Chen, G., Long, T., Xiong, J. & Bai, Y.  Multiple random forests modelling for urban water consumption forecasting. Water Resources Management 31 (15), 4715–4729. https:// doi.org/10.1007/s11269-017-1774-7. Colorni, A., Dorigo, M. & Maniezzo, V.  Distributed optimization by ant colonies. In: Proceedings of the European 2194 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Conference of Artiﬁcial Life, ECAL 91 (F. J. Varela & P. Bourgine, eds), Elsevier Publishing, Paris, France, pp. 134–142. Crone, S. F. & Kourentzes, N.  Feature selection for time series prediction – a combined ﬁlter and wrapper approach for neural networks. Neurocomputing 73, 1923–1936. doi:10. 1016/j.neucom.2010.01.017. Dahl, C. M. & Hylleberg, S.  Flexible regression models and relative forecast performance. International Journal of Forecasting 20 (2), 201–217. doi:10.1016/j.ijforecast.2003.09. 002. de Freitas, A. A. C.  Previsão de Séries Temporais via Seleção de Variáveis, Reconstrução Dinâmica, ARMA-GARCH e Redes Neurais Artiﬁcias. Doctoral thesis, Universidade Estadual de Campinas, Campinas, Brazil (in Portuguese). de Maria André, D. & Carvalho, J. R.  Spatial determinants of urban residential water demand in Fortaleza, Brazil. Water Resources Management 28, 2401–2414. doi:10.1007/s11269- 014-0551-0. Di, C., Yang, X. & Wang, X.  A four-stage hybrid model for hydrological time series forecasting. PLoS ONE 9 (8), e104663. https://doi.org/10.1371/journal.pone.0104663. Dietterich, T. G.  Ensemble methods in machine learning. In: Multiple Classiﬁer Systems: First International Workshop, MCS 2000 Cagliari, Italy, June 21–23, 2000 Proceedings (G. Goos, J. Hartmanis & J. van Leeuwen, eds), Springer, Berlin, Germany, pp. 1–15. https://doi.org/10.1007/3-540- 45014-9_1. Donkor, E. A., Mazzuchi, T. A., Soyer, R. & Roberson, J. A.  Urban water demand forecasting: review of methods and models. Journal of Water Resources Planning and Management 140 (2), 146–159. https://doi.org/10.1061/ (ASCE)WR.1943-5452.0000314. Du, K., Zhao, Y. & Lei, J.  The incorrect usage of singular spectral analysis and discrete wavelet transform in hybrid models to predict hydrological time series. Journal of Hydrology 552,44–51. doi:10.1016/j.jhydrol.2017.06.019. Elman, J. L.  Finding structure in time. Cognitive Science 14 (2), 179–211. https://doi.org/10.1207/s15516709cog1402_1. Feo, T. A. & Resende, M. G. C.  A probabilistic heuristic for a computationally difﬁcult set covering problem. Operations Research Letters 8 (2), 67–71. doi:10.1016/0167-6377(89) 90002-3. Firat, M., Turan, M. E. & Yurdusev, M. A. a Comparative analysis of fuzzy inference systems for water consumption time series prediction. Journal of Hydrology 374, 235–241. https://doi.org/10.1002/wrcr.20517. Firat, M., Yurdusev, M. A. & Turan, M. E. b Evaluation of artiﬁcial neural network techniques for municipal water consumption modeling. Water Resources Management 23, 617–632. doi:10.1007/s11269-008-9291-3. Firat, M., Turan, M. E. & Yurdusev, M. A.  Comparative analysis of neural network techniques for predicting water consumption time series. Journal of Hydrology 384,46–51. http://dx.doi.org/10.1016/j.jhydrol.2010.01.005. Freund, Y. & Schapire, R. E.  Experiments with a new boosting algorithm. In: Proceedings of the Thirteenth International Conference on Machine Learning (L. Saitta, ed.), Morgan Kaufmann Publishers, San Francisco, CA, USA, pp. 148–156. Froelich, W.  Forecasting daily urban water demand using dynamic Gaussian Bayesian network. In: Beyond Databases, Architectures and Structures. BDAS 2015 (S. Kozielski, D. Mrozek, P. Kasprowski, B. Małysiak-Mrozek & D. Kostrzewa, eds), Springer, Cham, Switzerland, pp. 333–342. https://doi.org/10.1007/978-3-319-18422-7_30. Fullerton Jr, T. M., Ceballos, A. & Walke, A. G.  Short-term forecasting analysis for municipal water demand. Journal American Water Works Association 108 (1), 27–38. http://dx. doi.org/10.5942/jawwa.2016.108.0003. Gagliardi, F., Alvisi, S., Kapelan, Z. & Franchini, M.  A probabilistic short-term water demand forecasting model based on the Markov Chain. Water 9, 507. doi:10.3390/ w9070507. Gardiner, V. & Herrington, P.  Water Demand Forecasting. Spon Press, Norwich, UK. Gashler, M., Giraud-Carrier, C. & Martinez, T.  Decision tree ensemble: small heterogeneous is better than large homogeneous. In: 7th International Conference on Machine Learning and Applications, 11–13 Dec., San Diego, USA, IEEE, pp. 900–905. doi:10.1109/ICMLA.2008.154. Ghalehkhondabi, I., Ardjmand, E., Yong II, W. A. & Weckman, G. R.  Water demand forecasting: review of soft computing methods. Environmental Monitoring and Assessment 189, 313. doi:10.1007/s10661-017-6030-3. Ghiassi, M., Zimbra, D. K. & Saidane, H.  Urban water demand forecasting with a dynamic artiﬁcial neural network model. Journal of Water Resources Planning and Management 134 (2), 138–146. doi:10.1061/(ASCE)0733- 9496(2008)134:2(138). Granger, C. W. J.  Combining forecasts – twenty years later. Journal of Forecasting 8, 167–173. doi:10.1002/for. 3980080303. Granitto, P. M., Verdes, P. F. & Ceccatto, H. A.  Neural network ensembles: evaluation of aggregation algorithms. Artiﬁcial Intelligence 163, 139–162. https://doi.org/10.1016/ j.artint.2004.09.006. Gupta, I., Gupta, A. & Khanna, P.  Genetic algorithm for optimization of water distribution systems. Environmental Modelling & Software 14, 437–446. https://doi.org/10.1016/ S1364-8152(98)00089-9. Guyon, I. & Elisseeff, A.  An introduction to variable and feature selection. Journal of Machine Learning Research 3, 1157–1182. Hansen, L. K. & Salamon, P.  Neural network ensembles. IEEE Transactions on Pattern Analysis and Machine Intelligence 12 (10), 993–1001. doi:10.1109/34.58871. Hassani, H.  Singular spectrum analysis: methodology and comparison. Journal of Data Science 5, 239–257. Herrera, M., Torgo, L., Izquierdo, J. & Pérez-García, R.  Predictive models for forecasting hourly urban water 2195 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 demand. Journal of Hydrology 387, 141–150. doi:10.1016/j. jhydrol.2010.04.005. Holland, J. H.  Adaptation in Natural and Artiﬁcial System. University of Michigan Press, Ann Arbor, MI, USA. Hopﬁeld, J. J.  Neural networks and physical systems with emergent collective computational abilities. Proceedings of National Academy of Science 79 (8), 2554–2558. https://doi. org/10.1073/pnas.79.8.2554. House-Peters, L., Pratt, B. & Chang, H.  Effects of urban spatial structure, sociodemographics, and climate on residential water consumption in Hillsboro, Oregon. Journal of the American Water Resources Association 46 (3), 461–472. doi:10.1111 ⁄ j.1752-1688.2009.00415.x. Hsu, H. H., Hsieh, C. W. & Lu, M. D.  Hybrid feature selection by combining ﬁlters and wrappers. Expert Systems with Applications 38, 8144–8150. doi:10.1016/j.eswa.2010.12. 156. Htike, K. K. & Khalifa, O. O.  Rainfall forecasting models using focused time-delay neural networks. In: International Conference on Computer and Communication Engineering (ICCCE 10), Kuala Lumpur, Malaysia. doi:10.1109/ICCCE. 2010.5556806. Huang, N. E., Shen, Z., Long, S. R., Wu, M. C., Shih, H. H., Zheng, Q., Yen, N., Tung, C. C. & Liu, H. H.  The empirical mode decomposition and the Hilbert spectrum for nonlinear and non-stationary time series analysis. Proceedings of the Royal Society A 454, 903–995. doi:10. 1098/rspa.1998.0193. Huang, G. B., Zhu, Q. Y. & Siew, C. K.  Extreme Learning Machine: theory and applications. Neurocomputing 70, 489–501. doi:10.1016/j.neucom.2005.12.126. Hutton, C. J., Kapelan, Z., Vamvakeridou-Lyroudia, L. & Savic´, D. A.  Dealing with uncertainty in water distribution system models: a framework for real-time modeling and data assimilation. Journal of Water Resources Planning and Management 140 (2), 169–183. https://doi.org/10.1061/ (ASCE)WR.1943-5452.0000325. Jaeger, H.  The ‘Echo State’ Approach to Analysing and Training Recurrent Neural Networks. GMD Report 148, German National Research Centre for Information Technology, St Augustin, Germany. Jang, J.-S. R.  Fuzzy modeling using generalized neural networks and Kalman ﬁlter algorithm. In: Proceedings of the 9th National Conference on Artiﬁcial Intelligence AAAI 91, Anaheim, CA, USA, Vol. 2, AAAI Press, pp. 762–767. Jang, J.-S. R.  ANFIS: adaptive-network-based fuzzy inference system. IEEE Transactions on Systems, Man and Cybernetics 23 (3), 665–685. doi:10.1109/21.256541. John, G. H., Kohavi, R. & Pﬂeger, K.  Irrelevant features and the subset selection problem.In: Machine Learning: Proceedings of the Eleventh International Conference (W. W. Cohen & H. Hirsh, eds), Morgan Kaufmann Publishers, San Francisco, CA, USA, pp. 121–129. doi:10.1016/B978-1-55860-335-6.50023-4. Jordan, M. I.  Serial Order: A Parallel Distributed Processing Approach. Technical Report 8604, Institute for Cognitive Science, University of California, San Diego, La Jolla, CA, USA. Kapelan, Z.  Calibration of Water Distribution System Hydraulic Models. PhD thesis, University of Exeter, Exeter, UK. Karunasingha, D. S. K. & Liong, S. Y.  Enhancement of chaotic hydrological time series prediction with real-time noise reduction using Extended Kalman Filter. Journal of Hydrology 565, 737–746. doi:10.1016/j.jhydrol. 2018.08.044. Kay, S. M. & Marple, S. L.  Spectrum analysis – a modern perspective. Proceedings of the IEEE 69 (11), 1380–1419. doi:10.1109/PROC.1981.12184. Kohavi, R. & John, G. H.  Wrappers for feature subset selection. Artiﬁcial Intelligence 97, 273–324. https://doi.org/ 10.1016/S0004-3702(97)00043-X. Koza, J. R.  Genetic Programming: A Paradigm for Genetically Breeding Populations of Computer Programs to Solve Problems. Computer Science Department, Stanford University, Stanford, CA, USA. Krogh, A. & Vedelsby, J.  Neural network ensembles, cross validation, and active learning. In: Proceedings of the 7th International Conference on Neural Information Processing Systems, NIPS 94 (G. Tesauro, D. S. Touretzky & T. K. Leen, eds), MIT Press, Cambridge, MA, USA, pp. 231–238. Liu, J. Q., Cheng, W. P. & Zhang, T. Q.  Principal factor analysis for forecasting diurnal water-demand pattern using combined rough-set and fuzzy-clustering technique. Journal of Water Resources Planning and Management 139 (1), 23–33. https://doi.org/10.1061/(ASCE)WR.1943-5452. 0000223. Makridakis, S. & Winkler, R. L.  Averages of forecasts: some empirical results. Management Science 29, 987–996. Melin, P., Soto, J., Castillo, O. & Soria, J.  A new approach for time series prediction using ensembles of ANFIS models. Expert Systems with Applications 39, 3494–3506. https://doi. org/10.1016/j.eswa.2011.09.040. Mendes-Moreira, J., Soares, C., Jorge, A. M. & de Sousa, J. F.  Ensemble approaches for regression: a survey. ACM Computing Surveys 45 (1), 10. doi:10.1145/2379776. 2379786. Nasseri, M., Moeini, A. & Tabesh, M.  Forecasting monthly urban water demand using Extended Kalman Filter and Genetic Programming. Expert Systems with Applications 38, 7387–7395. doi:10.1016/j.eswa.2010.12.087. Nauges, C. & Whittington, D.  Estimation of water demand in developing countries: an overview. The World Bank Research Observer 25 (2), 263–294. Oba, S., Sato, M., Takemasa, I., Monden, M., Matsubara, K. & Ishii, S.  Bayesian missing value estimation method for gene expression proﬁle data. Bioinformatics 19 (16), 2088–2096. doi:10.1093/bioinformatics/btg287. Odan, F. K.  Estudo de Conﬁabilidade Aplicado à Otimização da Operação em Tempo Real de Redes de Abastecimento de Água. Doctoral thesis, Escola de Engenharia de São 2196 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Carlos, Universidade de São Paulo, São Carlos, Brazil (in Portuguese). Odan, F. K. & Reis, L. F. R.  Hybrid water demand forecasting model associating artiﬁcial neural network with Fourier series. Journal of Water Resources Planning and Management 138, 245–256. doi:10.1061/(ASCE)WR.1943- 5452.0000177. Oshima, N. & Kosuda, T.  Distribution reservoir control with demand prediction using deterministic-chaos method. Water Science & Technology 37 (12), 389–395. https://doi.org/10. 1016/S0273-1223(98)00378-3. Peña-Guzmán, C., Melgarejo, J. & Prats, D.  Forecasting water demand in residential, commercial, and industrial zones in Bogotá, Colombia, using Least-Squares Support Vector Machines. Mathematical Problems in Engineering 2016, 5712347. http://dx.doi.org/10.1155/2016/5712347. Perrone, M. P. & Cooper, L. N.  When networks disagree: ensemble methods for hybrid neural networks. In: Neural Networks for Speech and Vision (R. J. Mammone, ed.), Chapman & Hall, London, UK, pp. 126–142. Piramuthu, S.  Evaluating feature selection methods for learning in data mining applications. European Journal of Operational Research 156 (2), 483–494. https://doi.org/10. 1016/S0377-2217(02)00911-6. Poli, I. & Jones, R. D.  A neural net model for prediction. Journal of the American Statistical Association 89 (425), 117–121. doi:10.1080/01621459.1994.10476451. Pulido-Calvo, I. & Gutiérrez-Estrada, J. C.  Improved irrigation water demand forecasting using a soft-computing hybrid model. Biosystems Engineering 102, 202–218. https:// doi.org/10.1016/j.biosystemseng.2008.09.032. Pulido-Calvo, I., Roldán, J., López-Luque, R. & Gutiérrez-Estrada, J. C.  Demand forecasting for irrigation water distribution systems. Journal of Irrigation and Drainage Engineering 129, 422–431. https://doi.org/10.1061/(ASCE) 0733-9437(2003)129:6(422). Qiu, X., Zhang, L., Ren, Y., Suganthan, P. N. & Amaratunga, G.  Ensemble deep learning for regression and time series forecasting. In: 2014 IEEE Symposium on Computational Intelligence in Ensemble Learning (CIEL). doi:10.1109/ CIEL.2014.7015739. Ren, Y., Zhang, L. & Suganthan, P. M.  Ensemble classiﬁcation and regression – recent developments, applications and future directions. IEEE Computational Intelligence Magazine 11, 41–53. doi:10.1109/MCI.2015.2471235. Romano, M. & Kapelan, Z.  Adaptive water demand forecasting for near real-time management of smart water distribution systems. Environmental Modelling & Software 60, 265–276. https://doi.org/10.1016/j.envsoft.2014.06.016. Rooney, N., Patterson, D., Anand, S. & Tsymbal, A.  Dynamic integration of regression models. In: Multiple Classiﬁer Systems: 5th International Workshop, MCS 2004, Cagliari, Italy, June 9–11, 2004, Proceedings (F. Roli, J. Kittler & T. Windeatt, eds), Springer-Verlag, Berlin, Germany, pp. 164–173. https://doi.org/10.1007/11871842_82. Saeys, Y., Inza, I. & Larrañaga, P.  A review of feature selection techniques in bioinformatics. Bioinformatics 23 (19), 2507–2517. https://doi.org/10.1093/bioinformatics/ btm344. Schleich, J. & Hillenbrand, T.  Determinants of residential water demand in Germany. Ecological Economics 68, 1756–1769. https://doi.org/10.1016/j.ecolecon.2008.11.012. Shabri, A. & Samsudin, R.  Empirical mode decomposition– least squares support vector machine based for water demand forecasting. International Journal of Advances in Soft Computing and Its Application 7 (2), 38–53. Sharkey, A. J. C.  On combining artiﬁcial neural nets. Connection Science 8 (3–4), 299–314. https://doi.org/10. 1080/095400996116785. Shepherd, A. J.  Second-Order Methods for Neural Networks: Fast and Reliable Training Methods for Multi-Layer Perceptrons. Springer, New York, USA. Sollich, P. & Krogh, A.  Learning with ensembles: how overﬁtting can be useful. In: Advances in Neural Information Processing Systems 8 (D. S. Touretzky, M. C. Mozer & M. E. Hasselmo, eds), MIT Press, Cambridge, MA, USA, pp. 190–196. Sorjamaa, A., Hao, J., Reyhani, N., Ji, Y. & Lendasse, A.  Methodology for long-term prediction of time series. Neurocomputing 70, 2861–2869. https://doi.org/10.1016/j. neucom.2006.06.015. Specht, D. F.  Probabilistic neural networks. Neural Networks 3 (1), 109–118. doi:10.1016/0893-6080(90)90049-Q. Stan´czyk, U.  Feature evaluation by ﬁlter, wrapper, and embedded approaches. In: Feature Selection for Data and Pattern Recognition (U. Stan´czyk & L. C. Jain, eds), Springer, Berlin, Germany, pp. 29–44. Tiwari, M. K. & Adamowski, J. F.  Medium-term water demand forecasting with limited data using an ensemble wavelet- bootstrap machine-learning approach. JournalofWater Resources Planning and Management 141 (2), 04014053. https://doi.org/10.1061/(ASCE)WR.1943-5452.0000454. Tiwari, M., Adamowski, J. & Adamowski, K.  Water demand forecasting using extreme learning machines. Journal of Water and Land Development 28,37–52. doi:10.1515/jwld- 2016-0004. Tsoi, A. C. & Back, A. D.  Locally recurrent globally feedforward networks: a critical review of architectures. IEEE Transactions on Neural Networks 5 (2), 229–239. doi:10.1109/72.279187. Tsonis, A. A.  Chaos: From Theory to Applications. Springer, New York, USA. Tsutiya, M. T.  Water Supply, 3rd edn. Department of Hydraulic and Sanitary Engineering of the Polytechnic School of the University of São Paulo, São Paulo, Brazil (in Portuguese). van den Oord, A., Dieleman, S., Zen, H., Simonyan, K., Vinyals, O., Graves, A., Kalchbrenner, N., Senior, A. & Kavukcuoglu, K.  WaveNet: a generative model for raw audio. arXiv:1609.03499. 2197 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022 Wang, L., Wang, Z., Qu, H. & Liu, S.  Optimal forecast combination based on neural networks for time series forecasting. Applied Soft Computing 66,1–17. https://doi. org/10.1016/j.asoc.2018.02.004. Webb, G. I. & Zheng, Z.  Multistrategy ensemble learning: reducing error by combining ensemble learning techniques. IEEE Transactions on Knowledge and Data Engineering 16 (8), 980–991. doi:10.1109/TKDE.2004.29. Wentz, E. A. & Gober, P.  Determinants of small area water consumption for the city of Phoenix, Arizona. Water Resources Management 21, 1849–1863. doi:10.1007/s11269- 006-9133-0. Wichard, J. D., Merkwirth, C. & Ogorzałek, M.  Building Ensembles with Heterogeneous Models. Available from: www.j-wichard.de/publications/salerno_Incs_2003.pdf (accessed 22 August 2018). Wilamowski, B. M. & Yu, H.  Neural network learning without backpropagation. IEEE Transactions on Neural Networks 21 (11), 1793–1803. doi:10.1109/TNN.2010.2073482. Williams,R.J.& Zipser,D.  A learning algorithm for continually running fully recurrent neural networks. Neural Computation 1 (2), 270–280. https://doi.org/10.1162/neco.1989.1.2.270. Wu, L. & Zhou, H.  Urban water demand forecasting based on HP ﬁlter and fuzzy neural network. Journal of Hydroinformatics 12 (2), 172–184. Xu, Y., Zhang, J., Long, Z. & Lv, M.  Daily urban water demand forecasting based on chaotic theory and continuous deep belief neural network. Neural Processing Letters. https://doi.org/10.1007/s11063-018-9914-5. Zanchettin, C.  Otimização Global em Redes Neurais Artiﬁciais. Doctoral thesis, Universidade Federal de Pernambuco, Recife, Brazil (in Portuguese). Zhang, G. P.  An investigation of neural networks for linear time-series forecasting. Computers & Operations Research 28 (12), 1183–1202. https://doi.org/10.1016/S0305-0548(00) 00033-2. Zhang, G. P.  Time series forecasting using a hybrid ARIMA and neural network model. Neurocomputing 50, 159–175. https://doi.org/10.1016/S0925-2312(01)00702-0. Zhang, G. P. & Qi, M.  Neural network forecasting for seasonal and trend time series. European Journal of Operational Research 160 (2), 501–514. doi:10.1016/j.ejor. 2003.08.037. Zhang, G., Patuwo, B. E. & Hu, M. Y.  Forecasting with artiﬁcial neural networks: the state of the art. International Journal of Forecasting 14,35–62. https://doi.org/10.1016/ S0169-2070(97)00044-7. Zhao, P. & Zhang, H. W.  Chaotic characters and forecasting of urban water consumption. China Water & Wastewater 24 (5), 90–94. First received 3 March 2019; accepted in revised form 12 August 2019. Available online 29 August 2019 2198 G. de Souza Groppo et al. | Numerical methods applied to water demand forecasting Water Supply | 19.8 | 2019 Downloaded from http://iwaponline.com/ws/article-pdf/19/8/2179/661652/ws019082179.pdf by Zhejiang University user on 17 January 2022","libVersion":"0.0.0","langs":"","hash":"","size":0}