{"path":".obsidian/plugins/text-extractor/cache/【z/040profane-世俗-论文-Zotero 插件-【Zotero】安装包+插件+总结笔记+思维导图-【Zotero思维导图】Zotero文献管理软件.png-980e18f648e0a843c4449e1c29b53c6c.json","text":"0 拥 有 众 多 开 源 插 件 , 实 现 不 同 的 功 能 ; 1. 简 介 : Zotero 是 开 源 的 文 浏 览 器 插 件 抓 取 : Zotero 的 最 大 优 点 献 管 理 工 具 , 支 持 安 装 在 网 门 伟 页 上 的 浏 览 器 插 件 , 与 献 题 录 直 接 抓 取 ; 菖ldI〕8薯皇等盂厘孛旱是′ 菖′「_菖′琶之 @ “ 文 件 夹 + 标 签 “ 的 双 管 理 系 统 ; 乐 一 1 立 J 机 什 , 而正 L a 81 士 61 : \\ E 【【/ \\垒、 鱼′」工，， 峰 在 浏 览 器 中 的 插 件 应 用 。 O 绢子首〔更_1+〕1…『夕〔笔工己 可 以 与 小 绿 鲸 联 @ 在 Word 中 进 行 文 献 引 用 。 @b 安 装 软 件 并 注 册 账 号 : https://Www.zotero.orgy/ @ 安 装 Zotero 浏 览 器 插 件 ; Zotero 把 整 个 同 步 分 为 两 个 部 分 : 数 据 同 步 + 文 件 同 步 。 @ 数 据 同 步 : 登 录 Zotero 账 号 + 在 高 级 更 改 本 【 敬 据 包 括 : 信 息 条 目 、 笔 记 、 标 签 、 链 接 等 , 地 文 件 夹 这 些 只 能 同 步 在 Zotero 里 面 , 但 这 个 是 免 费 无 限 瞌 简 单 暴 力 的 方 法 : 用 坚 果 云 直 接 同 步 整 个 数 据 文 数 据 同 步 与 管 理 制 的 】 件 夹 (Zotero 在 本 地 里 的 储 存 位 置 ) , 可 以 下 载 @ 在 首 试 仁 nk 日 宏 标 多 认 怡 名 止 . Q @ 【 文 件 包 括 : PDF、 音 频 、 视 频 等 等 。 这 些 文 件 眼 嚎 一 个 坚 果 云 客 户 端 , 右 键 把 它 变 成 一 个 同 步 文 件 在 首 选 项 里 登 录 账 号 , 实 现 多 设 备 同 步 : 7 口 你 可 以 选 择 同 步 在 Zotero 网 盘 里 , 也 可 以 选 择 其 瞌 夹 , 这 里 的 任 何 修 改 都 会 自 动 的 进 行 同 步 。 ( 这 @ .【Zotero 数 据 积 附 件 储 存 位 罡 要 他 网 盘 ( 目 前 国 内 支 持 WebDAV 接 入 的 网 盘 似 乎 | 嚏 样 做 的 好 处 是 条 目 信 息 和 文 件 是 在 一 起 的 ) 改 ! ! ! ! 】 只 有 坚 果 云 , 具 体 操 作 坚 果 云 有 保 妾 级 教 程 ) , - 孙 _ 这 样 空 间 就 不 受 限 制 了 , 但 是 条 目 信 息 和 文 件 就 B 5 吴 被 分 开 了 】 T ~ 心 二 一 / 英 文 : 点 击 浏 览 器 插 件 就 可 以 , 选 择 要 放 入 的 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 一 '/' 汀 刑 自 动 导 @ 从 网 页 端 抓 取 文 献 ; _ 文 件 夹 , 文 献 就 自 动 导 入 了 / / / / 如 果 下 载 不 了 PDF, 可 用 其 它 方 式 下 载 , / 然 后 将 下 载 的 文 件 拖 入 到 Zotero 当 中 , 正 \" @ 导 入 文 件 : “ 一 @ 常 是 可 以 自 动 识 别 文 献 的 题 目 , 如 果 没 有 / 92 ` . , 可 以 点 “ 重 帕 PDF 的 元 精 2 从 零 开 始 搭 建 Zotero: 疆空萼 可 以 点 击 右 键 “ 重 新 抓 取 PDF 的 元 数 ′′′ 1 仟 批 量 文 件 导 入 ; 1 1 @ 导 入 Endnote 中 已 有 的 文 献 库 . 1 1 、 一 佛 自 主 添 加 标 签 , 便 于 搜 索 和 定 位 1 0 FS: 一 u t Rnmggoottg - ′ 1 佛 可 以 添 加 图 片 ; … 1 u … | 习 北 一 一 G 添 加 笔 记 : - 一 l @ 与 小 绿 鲸 联 用 记 笔 记 。 1 1 【 建 议 把 自 动 同 步 功 能 取 消 , 使 用 手 动 同 | 仟 步 , 要 不 可 能 在 做 笔 记 的 时 候 笔 记 突 然 消 1 知薯 @ 【Word 安 装 不 上 Zotero 解 决 办 法 】 霍 1 @ 在 “ 首 选 项 “ 引 用 “ 里 搜 索 中 文 参 考 文 献 “ 国 1 刀 “ @ 改 好 的 国 标 格 或 00 1 s 院 ee \\ \\ 安 装 好 之 后 , 可 以 在 “Zotero 首 选 项 “ 中 , . 国 国 园 “Zotero-Scihub“ 就 可 以 输 入 最 新 的 scihub \\ 0 Zotero-Scihub ; 一 仪 的 地 址 、 点 击 文 献 右 键 也 可 以 看 到 有 一 个 | “Update Scihub PDF “。 \\ ′菩嚏击Z〔)t(…l「〔)(′刍青1`】歹F冒】)“首选顶渊高级删文{牛与 \\ 阀 文 件 夹 ““ 打 开 数 据 文 件 夹 ““ 选 择 第 一 个 稚 。 【 晴 换 掉 ; , 1 抓 取 中 文 的 信 息 条 目 ; \\ 2. 点 击 “ 编 辑 ““ 首 选 项 “, 在 “ 高 级 “ 旁 边 会 出 [ 现 “ 茉 莉 花 “ 图 标 , 勾 选 “ 添 加 中 文 PDF/CAJ \\ . 业 荣 八 , 一 自 动 抓 取 题 录 “「 将 “ 非 官 方 维 护 中 文 翻 译 \\ @ Jasminum ( 苗 苔 花 ) ; 一 人 躁 “ 更 新 一 下 , 这 回 点 击 中 文 期 刊 , 右 销 就 , 会 出 现 “ 抓 取 知 网 元 数 据 “; \\ 3.【 隔 一 段 时 间 看 一 下 是 否 需 要 更 新 】 \\ 4. 合 并 拆 分 姓 名 \\ 1 导 入 Zotero-quicklook 插 件 , \\ 然 后 下 载 dquicklook 软 件 , 1 G Quicklook: 一 @ 【 按 空 格 就 可 以 安 装 这 个 插 件 “QuickLook. \\ Plugin.OfficeViewer.qlplugin“, 就 可 以 \\ 对 Word、ppt、Excel、 视 频 等 进 行 预 览 】 \\ 1 批 量 修 改 文 献 的 格 式 , 文 献 的 语 言 ; | 重 启 后 点 击 文 献 右 键 , 出 现 “ 将 语 言 字 段 设 1 @ Delitemwithatt: - 一 @ 为 en“【 多 的 一 个 功 能 】, 在 打 开 Word 中 1 的 Zotero 插 件 , 点 “Refresh“, 会 发 现 “ 等 “ 韫 变 成 了 ret al“; = 1 对 Zotero 快 捷 键 的 设 置 心 二 辽 人 万 1 i , 口 在 “ 工 具 “ 栏 里 , 就 出 现 了 Zutilo 首 选 项 , 点 比 较 常 用 的 是 . 口 万 陪 藏 分 类 窗 格 -Alr+ L 【 大 面 | G Zutilo: 一 @ 进 天 就 是 一 个 传 援 键 的 设 置 , 根 据 使 用 习 兽翼昱_】 和 “ 显 示 / 隐 蕊 条 目 窗 格 -Alt+2“[ 右 面 的 = 惯 设 置 功 能 。 1 ZoOter0 1 将 “Zotfile“ 导 入 到 Zotero 中 , 这 时 候 在 “ 工 具 “ 辜 、 栏 里 , 就 出 现 了 “Zotfile Preferences“ ( 新 出 现 文 献 管 理 软 件 的 ) “ 点 进 去 ,“Renaming Rules“ 指 定 命 名 的 规 1 则 ( 只 保 留 标 题 ) 【 插 件 包 里 有 命 名 的 规 则 】。 1 @ 对 PDF 文 献 重 命 名 : 一 一 2. 选 择 厂 篇 文 献 , 右 键 选 择 “Manage 1 Attachments“ ( 新 出 现 的 ) “Rename 晏 颇tachmemS”ZO〔file京尤会工作更改命名′ 下次导 1 入 文 献 的 时 候 ,Zotfile 就 会 自 动 将 其 命 名 为 设 定 ! 的 格 式 。 ! 例 如 论 文 中 的 勾 画 和 批 注 , 点 击 有 键 选 择 1 skas; 门 。 “Manage Attachments“,【Get Table of 1 人 抓 取 PDF 文 献 笔 记 : 一 一 contents】 , 就 会 生 成 一 个 笔 记 文 件 , 刚 才 勾 画 1 的 重 点 问 价 就 在 这 里 面 了 。 1 1 打 开 坚 果 云 网 站 https:/wwwjianguoyun. / . comy , 下 载 相 应 的 版 本 安 装 在 电 脑 ; 1 伟 Zotfle: 2. 然 后 新 建 一 个 同 步 文 件 夹 , 点 击 有 键 选 择 坚 果 1 云 图 标 , 点 击 “ 同 步 该 文 件 夹 “; / 1 3.Zotero 丰 富 的 插 件 : 3. 回 到 Zotero 界 面 , 打 开 “ 首 选 项 “ 高 级 ““ 文 件 和 / u 文 件 夹 “ 根 目 录 “ 选 择 删 罚 | 同 步 的 文 件 夹 , 点 击 确 / 5 沥 1 4. 然 后 需 要 我 们 打 开 “ 首 选 项 ““ 同 步 “, 这 里 很 重 / 要 ! ! !1 ! “ 文 件 同 步 “ 里 选 择 使 用 “WebDAV>, / URL 里 填 写 “ 打 开 坚 果 云 的 网 页 端 , 选 择 “ 账 户 信 / 息 “ 里 的 “ 安 全 选 项 “,“ 添 加 应 用 “, 输 入 / . 一 心 otero“, 然 后 店 击 “ 生 成 密 码 “, 这 时 候 就 有 了 筒 单 暴 力 的 方 法 : 用 坚 果 云 直 接 同 步 整 个 “ 数 据 “ / @ Zotfle 插 件 和 坚 果 云 起 实 现 平 板 手 机 电 图 服 务 器 的 地 址 和 密 码 , 把 服 务 器 地 址 复 制 过 去 和 “ 链 接 附 件 文 件 夹 “ (“Zotero 在 本 地 里 的 储 存 位 哉 E 用 户 名 就 是 “ 注 册 时 候 的 用 户 名 “, 密 码 就 是 刚 园 / 生 成 的 。> @ 司 以 下 载 一 个 坚 果 云 客 户 端 , 右 键 把 它 变 成 一 个 眉 同 步 文 件 夹 , 这 里 的 任 何 修 改 都 会 自 动 的 进 行 同 5 这 里 需 要 注 意 ! ! ! “ 下 载 文 件 “ 改 成 “ 需 要 时 步 。 ( 这 样 做 的 好 处 是 条 目 信 息 和 文 件 是 在 一 起 “, 这 样 点 击 Zotero 右 上 角 的 刷 新 按 钮 才 会 同 步 ; 嵩) i 丘还需要点击(工具”选择痂t扭e Preferences“ 在 “General Settings“ 将 “Custom Location“ 改 成 我 们 的 “ 同 步 文 件 夹 >, 勾 选 “Use subfolder defined by ( 你 定 义 的 重 命 名 ) “; 7 这 时 候 点 击 右 键 选 择 “Mamage Attachments““Rename Attachments“, 这 时 候 文 献 就 有 了 链 接 的 图 标 , 这 就 表 明 我 们 已 经 上 传 到 云 端 了 , 我 们 可 以 打 开 坚 果 云 看 一 下 我 们 同 步 的 文 件 夹 ( 硕 士 期 间 ) , 就 可 以 看 到 云 端 就 有 这 篇 文 献 。 【 平 板 的 话 : 微 软 的 平 板 可 以 直 接 登 录 Zotero, 苹 果 需 要 下 载 一 个 papership 进 行 联 用 , 手 机 的 话 直 接 安 装 坚 果 云 就 可 以 查 看 了 】 侧 边 栏 预 览 ; 安 装 完 毕 后 , 点 击 论 文 , 在 右 面 侧 边 栏 就 @ 禹 8.Zotero-pdf-preview:, 一 @ 可 以 预 览 文 献 了 , 如 果 文 献 页 数 较 多 , 需 要 在 “Zotero 首 选 项 - 预 览 “ 中 , 更 改 “ 预 览 前 * 页 “。 c ozoeopatumue:, 目 gegeesagg 自 定 义 标 签 , 实 现 星 标 文 献 等 。 - 国 国 国 在 “Zotero 首 选 项 -zotero-tag“ 中 , 更 改 动 @ 10.Zotero-tag: Q 作 及 及 快 捷 键 。 可 以 自 定 义 标 签 , 例 如 “ 资 “, 可 以 指 派 颜 色 , 和 设 定 快 捷 键 。 合 并 重 复 条 目 ; 安 装 之 后 可 以 看 到 左 栏 出 现 了 一 个 “ 重 复 条 ; _ 人 目 “, 点 击 可 以 查 看 重 复 的 条 目 , 多 选 重 复 人 11.Zotero-DuplicatesMerger 一 @ 的 条 目 , 右 键 点 击 “Duplicates Merger“Bulk merge duplicates“ 便 可 以 实 现 批 量 合 并 了 。 _onr:。 【 月 文 字 识 别 , 可l′义斗寻7」卜更)I)l:[丑′曰〕之字于是]弓r叉至‖真{弋谛马一 @ 心 12.Zotero-ocr: 人 文 档 中 , 人 13.Zotero-updateifs: 一 @ 影 响 因 子 人 14.Zotero-night: 一 仟 夜 间 主 题 人 15.Keepzotero: - 一 @ Zotero 后 台 运 行 绑 定 : 在 Zotero 中 点 击 “ 编 辑 ““ 首 选 项 ““ 常 规 “, 这 里 打 开 PDF 使 用 自 定 义 : D 选 择 “ 小 绿 鲸 英 文 文 献 阅 读 器 “, 打 开 文 件 就 可 以 自 动 关 联 小 绿 鲸 了 , 备 注 、 速 读 、 多 端 口 翻 页 可 以 直 接 一 步 4.Zotero 与 “ 小 绿 鲸 英 文 文 献 阅 读 到 位 , 更 准 取 , 更 加 方 便 。 器 “ 联 合 应 用 小 绿 鲸 做 的 笔 记 可 以 直 接 同 步 到 座ter0中: 在Z0t【…]『o中′l害气击文再官犬右 @ 键 ,“ 从 注 释 中 添 加 笔 记 “, 可 以 将 小 绿 鲸 笔 记 的 内 容 同 步 到 Zotero 中 , 并 且 批 注 、 备 注 、 注 释 可 以 与 “ 小 绿 鲸 “ 共 享 。 0 方 向 键 左 、 右 来 打 开 和 收 回 条 目 。 全 部 展 开 Shift 加 + 来 实 现 , 收 回 按 - 可 以 在 Zotero 的 “ 编 辑 ““ 首 选 项 “ 常 规 e “ 将 “ 从 Web 页 面 创 建 条 目 时 生 成 快 照 “ 以 及 “ 使 用 关 键 词 和 标 签 自 动 给 条 目 施 5.Zotero 快 捷 键 , 设 置 等 : 加 标 签 “ 取 消 ; e 标 签 颜 色 有 对 应 的 编 号 : 选空叠=意=文南)茭茧幕俞_〔_置 人 入 对 应 数 字 就 可 以 打 上 标 签 ; 果`十 了土]_…__:叉上针言‖ { 乍 安 装 quicklook 之 后 , 按 “ 空 格 键 “ 预 / 口 览 ,; G 与 小 绿 鲸 “ 联 用 后 , 按 “ 回 车 “ 键 进 行 _置 阅 读 ;","libVersion":"0.0.0","langs":"chi_sim+eng","hash":"","size":0}