{"path":".obsidian/plugins/text-extractor/cache/gh/040_profane-世俗-论文-英文-Ghalehkhondabi2017_Article_WaterDemandForecastingReviewOf.pdf-99a4c5cb26688d6bf23e9f0ff9e5571d.json","text":"Water demand forecasting: review of soft computing methods Iman Ghalehkhondabi & Ehsan Ardjmand & William A. Young II & Gary R. Weckman Received: 5 April 2016 / Accepted: 30 May 2017 / Published online: 6 June 2017 # Springer International Publishing Switzerland 2017 Abstract Demand forecasting plays a vital role in re- source management for governments and private com- panies. Considering the scarcity of water and its inherent constraints, demand management and forecasting in this domain are critically important. Several soft computing techniques have been developed over the last few de- cades for water demand forecasting. This study focuses on soft computing methods of water consumption fore- casting published between 2005 and 2015. These methods include artificial neural networks (ANNs), fuzzy and neuro-fuzzy models, support vector ma- chines, metaheuristics, and system dynamics. Further- more, it was discussed that while in short-term forecast- ing, ANNs have been superior in many cases, but it is still very difficult to pick a single method as the overall best. According to the literature, various methods and their hybrids are applied to water demand forecasting. However, it seems soft computing has a lot more to contribute to water demand forecasting. These contribu- tion areas include, but are not limited, to various ANN architectures, unsupervised methods, deep learning, var- ious metaheuristics, and ensemble methods. Moreover, it is found that soft computing methods are mainly used for short-term demand forecasting. Keywords Demand uncertainty . Demand prediction . Water consumption . Forecasting methods . Neural networks . Time series Introduction Forecasting is an important activity in demand manage- ment, and it becomes critical when dealing with manag- ing a scarce resource such as water. Population growth, water consumption increase, climate change, and popu- lation characteristics are among some of the factors that are causing concern about the shortage of water re- sources (Adamowski and Karapataki 2010;Odan and Reis 2012). There are already many regions in the world where water shortage has turned into a severe condition or the signs of such condition are emerging. One of the most important Iranian watersheds, the Zayandeh-Rud river, has been under continuous drought stress in the past several years, and the severity of the problem is magnified by inefficient water management (Gohari et al. 2013). Reduced rainfall since 2003 has decreased the water reserves to less than 10% in Greece (Gabriel Environ Monit Assess (2017) 189: 313 DOI 10.1007/s10661-017-6030-3 I. Ghalehkhondabi (*) : G. R. Weckman Department of Industrial and Systems Engineering, Russ College of Engineering and Technology, Ohio University, Athens, OH 45701, USA e-mail: ig.khondabi@ohio.edu G. R. Weckman e-mail: weckmang@ohio.edu E. Ardjmand Department of Management, College of Business, Frostburg State University, Frostburg, MD 21532, USA e-mail: eardjmand@frostburg.edu W. A. Young II, Management Information Systems Department, College of Business, Ohio University, Athens, OH 45701, USA e-mail: youngw1@ohio.edu 2008). In southeast Queensland, Australia, shortage of rainfall and the population growth between 2005 and 2008 have led to water resource concerns for municipal areas (Commission 2009). These are just some of the examples among many and yet, the evidence shows a steady growth in both average and peak water consump- tion in recent years, which can overburden the water reserves further (Adamowski and Karapataki 2010). Dealing with this problem requires efficient demand management and forecasting techniques. BThe purpose of water demand forecasting is to make forward-looking information available to public water suppliers as they conduct their business^ (Billings and Jones 2011). Regarding the efficient management of water supply operations, it is necessary to have an accurate forecasting system as well (Maas 2003). Ghiassi et al. (2008) point out that the increased energy costs made the water com- panies optimize their supply operations. Since one of the main objectives of the water supply facilities is to supply quality water at a reasonable price, minimizing the ener- gy spent on the water supply is another necessity which requires more accurate water demand forecasting (Odan and Reis 2012; Dziegielewski and Baumann 1992). Researchers and practitioners have extensively stud- ied the water demand forecasting problem in recent years. A simple look into the number of articles pub- lished in recent years with topics including Bwater,^ Bforecast^ or Bprediction,^ and Bdemand^ or Bconsumption^ clearly points to the increasing focus of the scientific community in this area (Fig. 1). The data shown in Fig. 1 is based on the results from Thomson Reuters’ Web of Science. The search is based on including the word water in the title of the articles and considering the words demand, consumption, fore- cast, and Bpredicts^ as the topic(s) of the articles. Both graphs show the increased number of publications on the topic in the past 20 years. This increase can be the result of an increased number of researchers in the field. However, the increasing number of publications can be the result of the increasing scarcity of water resources and the growing importance of water demand manage- ment in recent years. The literature on water demand forecasting problems can be reviewed from various perspectives. Focusing on the supply side of the problem, Arbués et al. (2003) reviewed the papers dealing with pricing and demand structure in water consumption forecasting. As for the variables that impact the water demand, price, income, weather, population, housing characteristics, frequency of billing, and indoor/outdoor usage were reviewed in the literature. Using a similar scope, Worthington and Hoffman (2008) reviewed the literature on factors that impact water demand and reported the price, income, weather, population, and non-price consumption con- trols as the most common themes in the literature. In another study, White et al. (2007) reviewed water de- mand forecasting and demand management techniques in order to start the construction of a comprehensive database of industry knowledge to identify the research gaps. a) b) 0 20 40 60 80 100 120 Demand Consumption 0 20 40 60 80 100 120 140 160 180 Demand Consumption Fig. 1 Published papers with titles including a water demand/consumption forecasting and b water demand/consumption prediction between 1995 and 2015 313 Page 2 of 13 Environ Monit Assess (2017) 189: 313 House-Peters and Chang (2011) took advantage of a coupled human and natural systems framework to review the methodological advances in modeling water con- sumption in the literature. Their review encompassed four main domains, including Binteractions within and across multiple spatial and temporal scales,^ Backnowledgment and quantification of uncertainty,^ Bidentification of thresholds, non-linear system response, and consequences for resilience,^ and Bthe transition from simple statistical modeling to fully integrated dynamic modeling.^ Following the suggested planning levels of short, medium, and long term by several authors in regard to water demand forecasting literature (Ghiassi et al. 2008; Alvisi et al. 2007;Jain et al. 2001), Donkor et al. (2012) reviewed the urban water demand forecasting literature. They concluded that application of the methods in liter- ature was dependent upon the periodicity and forecast horizon. For instance, they found that neural networks were more likely to be used for short-term forecasting, while econometric models and simulation were used more often for long-term forecasting. In spite of many developments in water demand fore- casting methods, non-stationary and non-linear data and intrinsic stochasticity of demand remain a major challenge in this field (Gutzler and Nims 2005). In this regard, soft computing methods have contributed tremendously to methodological advancement in water demand forecast- ing. Soft computing is Ba collection of methodologies that aim to exploit the tolerance for imprecision and uncertainty to achieve tractability, robustness, and low-solution cost^ (Zadeh 1994). Soft computing methods are capable of processing information in real-life ambiguous and highly non-linear situations (Mitra et al. 2002;Zadeh 1994). To the best of the authors’ knowledge, there is no review paper dedicated to the study of soft computing methods in water demand forecasting, and it is the aim of the current study to address this issue. Reviewing these methods will help to understand the gaps in the literature in regard to soft computing technique applica- tions in water demand forecasting. The remainder of this paper is organized as follows. BSoft computing methods in water demand forecasting^ reviews soft computing methods in water demand fore- casting studies from 2005 to 2015. Publications on each method are explained in the related subsection. BDiscussion^ discusses the findings of the review, gaps, and possible future directions; and finally, BConclusions^ presents some suggestions for possible future research and states the conclusion. Soft computing methods in water demand forecasting Soft computing includes a variety of methods which are designed to deal with imprecision, stochasticity, and non-linearity (Bonissone 1997). In terms of water de- mand forecasting, imprecision of the existing data, stochasticity of the situation, and non-linearity of the consumption systems can turn the prediction into a very difficult task. In this section, the existing literature on the application of soft computing methods in water demand forecasting between 2005 and 2015 will be reviewed. For this purpose, the found studies will be categorized based on the methods. Moreover, the most cited and highest quality articles of each category are summarized in a comparative table at the end of each subsection. Artificial neural networks The artificial neural network (ANN) is a data-driven approach, which mimics the brain and nervous system in learning patterns. ANNs are extensively used for forecasting purposes in various domains, and in many occasions are shown to have an excellent predictive ability (Millie et al. 2014;Ardjmand etal. 2016;Msiza et al. 2007; Babel and Shinde 2011). A neural network is composed of a network of processing elements (PEs), which are connected to each other by different weights and architectures. PEs are usually arranged in layers. One layer is dedicated to receiving the input variables for forecasting (input layer), one layer is used to calcu- late the output (output layer), and the rest of layers (hidden layers) transform the inputs into outputs (Zhang et al. 1998). The layers of an ANN can be fully or partially connected, and for the purpose of forecasting the weights, need to be adjusted accordingly. The pro- cess of adjusting the weights in order to minimize the forecasting error of ANN is done by training algorithms (Amin-Naseri et al. 2013). ANNs are an attractive tool for forecasting for several reasons. First, they do not require as many assumptions as traditional statistical models (Zhang et al. 1998). Second, in many cases, they can generalize the results and forecast the output of unseen data (Zhang et al. 1998). Third, they can model highly non-linear relations in the data and estimate any non-linear function to a high degree of accuracy (Hornik et al. 1989; Funahashi 1989). ANNs can use historical data to forecast the future values of possibly noisy multivariate time series Environ Monit Assess (2017) 189: 313 Page 3 of 13 313 (Adamowski et al. 2012). Each ANN is trained by an in- hand dataset and compares the achieved results with the actual output data until acceptable outputs are obtained (Ghiassi et al. 2008). ANNs can be categorized into many various types; among which, only a limited number are used in water demand forecasting. One of the mostly popular ANNs in the area water demand forecasting are feedforward neural networks (FNNs). In a FNN, the information only moves forward and there is no loop or cycle in the network. Numerous studies have shown that FNNs out- perform regression and time series analysis in water demand forecasting. Bougadis et al. (2005) applied a FNN to the problem of short-term municipal water demand forecasting in Ottawa, Ontario, Canada and found that FNNs consis- tently outperform regression and time series models. Similarly, Pulido-Calvo et al. (2007) also found that FNNs yield more accurate results when compared with regression analyses. Adamowski (2008), in forecasting the peak daily summer water demand via FNNs, multiple linear regression, and time series analyses, found that FNN outperforms the other methods. He used the consumption data from May to August in Ottawa, Canada, and the ANN was shown to have a better prediction ability compared to regression and time series analysis. In another study, Adamowski and Karapataki (2010) compared the multiple linear regres- sion and multilayer perceptron ANNs with three differ- ent types of learning algorithms to forecast the weekly peak water demand in Cyprus. The maximum weekly temperature and total weekly rainfall were considered the most effective variables, and 6 years’ worth of data from the city of Nicosia was applied to the models. The results showed that the ANN model with a Levenberg- Marquardt learning algorithm yielded better results in comparison with ANNs with resilient back-propagation and conjugate gradient Powell-Beale learning algo- rithms, while also outperforming multiple linear regres- sion models. Besides the learning algorithms, the num- ber of hidden layers and neurons in each layer can also directly impact the ANN’s performance. Finding the best architecture for an ANN can be a very difficult task, and in this regard, a FNN might not always be the method with the best results (Herrera et al. 2010). Fo- cusing on this issue, Sun et al. (2012)used an empirical formula and trial-and-error method to minimize the water demand forecasting error. Azadeh et al. (2011) compared the results of fuzzy linear regression and ANNs in forecasting the water consumption in Tehran, Iran from April 2004 to March 2009 and concluded that—depending on the temperature—one of these methods outperforms the other. They found that in warm days, ANN outperformed the fuzzy linear regression model. However, for cold days, both performed at the same level. All the reviewed FNN-related studies in water demand forecasting literature deal with short- term demand while considering the consumption and climatic data as input variables of the network. Adamowski et al. (2012) used a wavelet artificial neural network (WA-ANN) for forecasting daily water demand data of Montreal from 2001 to 2009. A WA- ANN, instead of using the inputs directly, takes advan- tage of a subseries of components obtained from dis- crete wavelet transform (DWT) on the time series. This method has the advantage of using abstract local infor- mation in time series (Minu et al. 2010). The results of the study by Adamowski et al. (2012) showed that the WA-ANN model provides more accurate forecasts than multiple linear regression, multiple non-linear regres- sion, ARIMA, and classical ANN models. Besides sim- ply extracting the main and local information in time series, the WA-ANN can also reduce the variance in ANN inputs, and hence improve the forecast accuracy. In a study conducted by Campisi-Pinto et al. (2012), it was shown that the ability of WA-ANNs in variance reduction produces better results in water demand fore- casting when compared with simple ANNs and multiple linear regression. A wavelet-bootstrap ANN model to forecast short- term urban water demand was proposed by Tiwari and Adamowski (2013). They applied the model to a dataset from Montreal, Canada and showed that the model outperforms ARIMA, auto-regressive integrated mov- ing average model with exogenous input variables (ARIMAX), traditional ANNs, wavelet analysis-based ANNs, bootstrap-based neural networks, and naïve persistence index models. Additionally, they showed that including the maximum temperature and total precipitation improves the accuracy of water demand forecasts using wavelet analysis. Mohammed and Ibrahim (2012) used a discrete wavelet-transformed data and multilayer perceptron neural network to predict the municipal water consumption of Tampa, FL. Unlike FNN, studies related to WA-ANNs are used for short- to medium-term forecasting periods (up to 6 months). However, similar to FNN literature, beside the water 313 Page 4 of 13 Environ Monit Assess (2017) 189: 313 consumption history, climatic variables are the only type of inputs considered in WA-ANNs. A special case of FNNs are dynamic architecture neural networks (DAN2) (Ghiassi and Saidane 2005). In DAN2, the number of neurons in each layer is fixed, while the number of hidden layers needs to be deter- mined in order to minimize the error criteria. This to- pology of ANN is shown to be very effective in water demand forecasting. Ghiassi et al. (2008) developed a dynamic ANN model for comprehensive urban water demand forecasting. They showed that including weath- er information improves the accuracy of forecasts. Their model produced 99%-accurate forecasts for daily, week- ly, and monthly periods, and 97%-accurate forecasts for the hourly models. They compared their proposed DAN2 model to an auto-regressive integrated moving average (ARIMA) to assess the quality of their proposed model and concluded that it outperforms ARIMA in predicting monthly, weekly, daily, and hourly water demand. Odan and Reis (2012) used DAN2 in addition to using the error of Fourier series forecasting as input, and found that the result of this hybridization yields better results compared to a simple ANN and DAN2 when used for forecasting the hourly water consumption of Araraquara in São Paulo, Brazil. As the review of literature on the application of DAN2 in water demand forecasting shows, similar to an ANN, DAN2 is more focused on short-term forecasting and uses consumption and climatic input variables. While FNNs provide an excellent tool for water demand forecasting, the repetitive patterns of consump- tion over time make the radial basis function neural networks (RBFN) a good choice for predicting the demand as well. A RBFN measures the similarity of an instance to the training set using Euclidean distance and is a very useful tool for function approximation and pattern recognition (Yingwei et al. 1997). One major advantage of RBFNs over FNNs is the amount of com- putational effort in training them (Bullinaria 2014). It is possible to train a RBFN without solving a hard non- linear optimization problem to determine the weights of the network. This property is especially useful when dealing with very large-scale networks. The instances of using RBFN in water demand forecasting in the literature are very limited, and it is difficult to draw any conclusion regarding the relative performance of RBFN when compared to other ANN architectures. Yurdusev et al. (2009) compared RBFN andFNN forpredictingthemonthlywater demand consumption in Izmir, Turkey and concluded that although both types of networks perform closely, the RBFN slightly outperforms the FNN. Liu and Chang (2010) compared ANNs and a gray forecast model for water demand in the city of Yangquan in China and found out that ANNs outperform the gray forecast by a considerable margin. Bennett et al. (2013) applied two FNNs and one RBFN to build a residential water end- use demand forecasting model and found that FNNs outperform the RBFN. They concluded that the most accurate FNNs have a sigmoid transfer function in the hidden layers and a linear transfer function in the output layer. The literature of RBFN shows that this type of ANN is used in short- and long-term forecast- ing of water demand. Unlike previously discussed architectures, in some RBF studies, socioeconomic factors are also considered a predictor of the demand. General regression neural networks (GRNNs) are another type of ANN used for water demand forecast- ing. GRNN is a memory-based network used for func- tion estimation and when trained, converges to a non- linear regression surface. One advantage of GRNN is its computationally inexpensive one-pass training al- gorithm (Specht 1991). Similar to RBFN, the in- stances that apply GRNN to water demand prediction in the literature are very limited. Zhou and Yang (2010) forecasted long-term water demand in the Yel- low River Basin using GRNN and consumption data as the input variable. They used a particle swarm optimization (PSO) algorithm with linear inertia weight and chaos variation operators to determine the smoothing parameter of the GRNN and found that their model prediction ability is superior when com- pared to back-propagation FNNs based on genetic algorithms, as well as GRNN based on genetic algorithms. Another type of ANN used for water demand fore- casting is a cascade-correlation neural network (CCNN). The architecture of CCNNs is very flexible and adds a PE, training it separately whenever it helps to solve the problem (Fahlman and Lebiere 1989). In this regard, the training process is computationally less extensive. In a comparative study conducted by Firatetal. (2010), using historical consumption as the input variable, they found that CCNN is slightly better than FNN and GRNN when applied to the problem of short-term water consumption prediction in Izmir, Turkey. Environ Monit Assess (2017) 189: 313 Page 5 of 13 313 Fuzzy and neuro-fuzzy models Fuzzy logic is primarily concerned with the manipula- tion of sets with non-deterministic boundaries (Zadeh 1994). In this regard, fuzzy logic can be used for ap- proximate reasoning. Since in forecasting one usually deals with uncertain outcomes, fuzzy models are one class of widely used tools in this area. Fuzzy logic is especially useful in modeling qualitative and imprecise data and systems, such as human reasoning processes, making decisions based upon vague or imprecise data and considering uncertainty at various levels (Zadeh 1994; Iyatomi and Hagiwara 2004). Subject to the val- idation of the results by an expert, fuzzy forecasting methods have the advantage of being applied to incom- plete data (Hong et al. 2003). Fuzzy sets are used by fuzzy methods, which enable the modelers to reduce a large amount of data into a smaller amount of variable rules (Mamlook et al. 2009). Along with fuzzy logic and models, the hybridization of fuzzy logic and ANNs, resulting in neuro-fuzzy models, has also been widely used in water demand forecasting. Neuro-fuzzy models possess the pattern recognition ability of ANNs and the reasoning ability of fuzzy logic (Nauck and Kruse 1997). Atsalakis et al. (2007) used the neuro-fuzzy systems to predict irrigation water consumption. In their study, the adaptive neuro-fuzzy inference system was com- pared with the auto-regressive methods and resulted in a better prediction power on daily water consumption. Tabesh and Dini (2009a, b) compared several fuzzy and neuro-fuzzy models to forecast the short-term water demand in Tehran. Daily average temperature, relative humidity percentage, and the consumption for the pre- vious day, week, and year were used as the input vari- ables. Their results showed that the accuracy of neuro- fuzzy models outperformed the classical fuzzy models. As shown by Liu et al. (2009), the results of the neuro- fuzzy models that just consider water consumption have a highdegreeofaccuracyaswell. A fuzzy neural network was applied by Li and Huicheng (2010) to forecast the urban water demand for the city of Dalian, China. The forecast was obtained by combining the multiple linear regression method— which was used to simulate the trend components—and the fuzzy ANN, which was built based upon the cyclical components. The authors concluded that the proposed model was more accurate than the traditional methods. Liu et al. (2012) used a fuzzy clustering technique to forecast the daily water demand of Hangzhou, China. An attribute reduction algorithm was used to figure out the most important affective factors regarding water demand. They proposed a fuzzy c-mean algorithm to identify the daily water demand pattern. The results of their case study showed that the water demand pattern was affected by the factors of maximum/minimum air temperature and whether it was a weekend or weekday. The same problem was studied by Ahmadi et al. (2014), where they used the fuzzy cognitive map learning meth- od to forecast the water demand. The fuzzy cognitive map models complex systems as a collection of con- cepts and underlying relationships between concepts. The water demand data for the island of Skiathos, Greece was applied to show the efficiency of their model. Recently, Vijayalaksmi and Babu (2015)useda neuro-fuzzy inference system to forecast the water de- mand for Tamil Nadu, India. Six adaptive neuro-fuzzy inference systems were developed, due to the different numbers of membership functions and time periods. The results show that the increase in the input parameters improved the performance of the presented models. In another recent study, Papageorgiou et al. (2015) predicted the water demand by using fuzzy cog- nitive maps. They optimized the fuzzy cognitive maps’ learning process using genetic algorithm. The effect of the mean temperature, high temperature, wind speed, precipitation, and touristic activity variables on daily water demand was analyzed and the applicability of the proposed method was shown by simulation runs. Support vector machines Boser et al. (1992) developed the support vector ma- chines (SVM) as a machine learning method associated with learning tasks such as classification and regression. SVM is based on the idea that non-linear trends in input space can be mapped to linear trends in a higher dimen- sional feature space and recognizes the subtle patterns in complex datasets by using a learning algorithm. The generalization property of an SVM is not dependent upon the complete training data, and only the support vectors are enough for generalization. Unlike the neural networks that minimize the empirical error, SVM seeks to minimize the upper bound of the generalization error (Vapnik 2013). SVMs have two main categories—sup- port vector classifiers and support vector regressions. Support vector regression (SVR) tries to achieve the 313 Page 6 of 13 Environ Monit Assess (2017) 189: 313 generalized performance by minimizing the generaliza- tion error bound (Basak et al. 2007). Wang et al. (2005) applied a SVM method to the problem of hourly water demand forecasting and com- pared it against back-propagation ANN. Their study resulted in a 2% improvement when using SVM as well as better generalization performance. Chen and Zhang (2006) used the least square SVM to forecast the hourly water demand. Their proposed method was applied in order to avoid the problems of overfitting and getting trapped in a local minimum. They found that SVM performs better in terms of generalization when com- pared to ANN. The Bayesian least squares SVM was used by Tu-qiao (2006) to predict hourly water demand. The Bayesian framework was used to determine the model parameters. Their case study showed that the proposed model was both faster and more accurate than the classical least squares SVM model and BP neural network. Liu and Chang (2008)used the SVM to forecast the water demand in Shanxi, China. They considered 17 independent variables to forecast water consumption and concluded that the developed model works better when the sample data is smaller in size. Zhang et al. (2008) combined the SVM with genetic algorithms to forecast the urban water demand con- sumption. The authors applied the SVM model in order to better deal with the small size of their sample and applied GA to determine the Lagrange multipliers. They concluded that the developed model was more accurate in predicting the urban water consumption when compared to more traditional methods. In another study, a SVM method was proposed by Lei (2009)to deal with hourly water demand prediction. The pro- posed model was both faster and more precise than the BP neural network and traditional SVM models. Rijun and Huifang (2010)used the SVMto predict the water demand in the Poyang Lake area of China. They analyzed error curve variation by the choice of model parameter and kernel function. Lei (2011)pro- posed a city hourly water consumption forecasting method based on genetic algorithms and SVM in which the genetic algorithms were used to optimize the parameters of the SVM. Their method resulted in higher forecasting performance when compared to a simple SVM. The problem of forecasting the urban water demand for Shanghai in China was studied by Ji et al. (2014) using a SVM model. An ameliorated teaching-learning optimization was applied to improve the prediction accuracy of the least squares SVM. Metaheuristics BMetaheuristics, in their original definition, are solution methods that orchestrate an interaction between local improvement procedures and higher level strategies to create a process capable of escaping from local optima and performing a robust search of a solution space^ (Glover and Kochenberger 2006). The approach in metaheuristics consists of transcribing the tendency in a natural phenomenon towards improvement in mathe- matical symbols and codes, and in reducing the problem-solving operations to an algorithm that consis- tently traces the dynamics of that metaphorically de- ployed phenomenon. In water demand forecasting models, metaheuristics are usually used to tune the parameters of other methods, estimate the coefficients of a function, or train an intelligent agent such as ANN. Evolutionary methods are among one of the most frequently used metaheuristics in the water demand forecasting field. Evolutionary methods are based on the idea of natural selection and survival of the fittest in Darwinian evolu- tion theory (Holland 1975). In these types of methods, the results are based on the Bcollective learning process within a population of individuals^ (Bäck and Schwefel 1993). Pulido-Calvo and Gutierrez-Estrada (2009)proposed a hybrid methodology composed of FNN, fuzzy logic, and genetic algorithms to forecast daily water demands 1 day ahead in Andalucía, Spain. They found that this hybrid methodology significantly outperformed the uni- variate and multivariate auto-regressive neural net- works. The short-term water demand forecasting prob- lem of a district water system in the UK was studied by Wu and Yan (2010) using genetic programming, where the approaches of tree-based genetic programming and gene expression programming were applied by the authors. Varahrami (2010)predicted theshort-termwa- ter demand by applying the GA to a neural network. She compared two different neural networks using classical back-propagation and GA learning algorithms and showed that the GA learning algorithm presented more precise forecasts on the test data. Moreover, Nasseri et al. (2011) combinedanextend- ed Kalman filter and genetic programming to forecast the monthly water consumption for Tehran, Iran. The proposed model applied the extended Kalman filter to infer latent variables in order to forecast the water consumption based upon the GP results. Forecasting Environ Monit Assess (2017) 189: 313 Page 7 of 13 313 the water demand in Tangshan, China was studied by Yanyan (2012) using a regression-based model. The hybrid algorithm of genetic algorithms and PSO was coupled with the projection pursuit regression model based upon Hermit multinomials in order to tackle the problems of non-linearity and high dimension in water demand forecasting. To the best of the authors’ knowledge—with the exception of evolutionary methods—PSO (Zhou and Yang 2010;Bai 2014), teaching-learning-based optimi- zation (TLBO) (Ji et al. 2014), imperialist competitive algorithms (Ahmadi et al., 2014), and shuffled complex evolution metropolis algorithms (Cutore et al. 2008)are the only metaheuristics used in water demand forecasting. System dynamics models System dynamics (SD) was developed by Forrester (1961) at the Massachusetts Institute of Technology. SD is a computer-oriented approach that uses the inter- relation of variables in a complex setting. The main characteristics of SD include the existence of a complex system, time-to-time variations regarding the system’s behavior, and the existence of the feedback in a closed loop, which was considered new information about the system’s condition at the time. Building a SD model is an iterative process that uses causal and feedback rela- tionships. These relationships are built on differential equations, variables, and parameters. More explicitly, the SD model is a system of stocks and flows connected through auxiliaries. Although SD methodology is ap- plied to the water demand forecasting problem, its ap- plication is rather limited compared to other soft com- puting methods. Predicting the industrial water demand was studied by (Liu et al. 2008) by applying SD analysis. The authors combined the SD with the block prediction method to develop a model for the cases where the lack of foundation data exists. Zhai (2009)used the SD to forecast the water resource demand. The proposed mod- el was defined by three stocks, five flows, and thirty-one converters. The SD approach was also used by (Zhang et al. 2009) to forecast the water demand for the city of Tianjin, China. The SD model was constructed based on the analysis of water resource systems, which were characterized by multifeedback and non-linear interac- tions among the system’selements. Recently, Dhungel and Fiedler (2014)used the SD to predict the water demand in the city of Pullman in WA State. The focus of the authors was on finding the water price elasticity by forecasting the demand. Three eco- nomic scenarios regarding the total residential house- holds’, single-family households’, and total popula- tions’ water use in the city were developed in order to investigate the influence of individual variables on the final price elasticity of water demand. SD was used to develop an economic model based on the regression equation of price elasticity. Discussion As the reviewed studies illustrate, in the context of water consumption and demand forecasting, soft computing methods are being studied extensively. However, a clos- er look at the existing literature and recent advances in soft computing suggests that this area still has a lot to offer for water demand forecasting. In this regard, sev- eral soft computing areas can contribute further to the problem. The first soft computing method reviewed was neural networks. This study showed that only a limited number of neural network architectures were used in water de- mand forecasting. For instance, no publication was found to use recurrent neural networks, which is one of the most widely used forecasting methods in areas such as energy and finance (Barbounis et al. 2006; Kuan and Liu 1995). Moreover, the focus of water demand forecasting literature when using neural network methods has been mostly on supervised methods, where the network learns by observing previous instances. In this regard, while being widely used in other forecasting contexts (Djukanovic et al. 1993; Pavlidis et al. 2003), unsupervised methods of learning are rather ignored in the water demand forecasting literature. The most recent advancements in the neural networks domain were not applied to the water demand forecasting problem. For instance, deep learning methods—which have been shown to be highly promising in other forecasting areas (Qiu et al. 2014)—remain to be used in water demand forecasting. Another potential future research direction is the application of metaheuristics in water demand forecast- ing. For instance, in addition to some metaheuristics such as ant colony optimization (ACO) and simulated annealing (SA) not being used, the literature on other 313 Page 8 of 13 Environ Monit Assess (2017) 189: 313 models, such as PSO and TLBO, includes only a very limited number of studies. The flow of the recent studies shows that the individ- ual classical methods cannot present the most accurate results anymore, and most of the dominant methods are the developed combined methods. It seems that present- ing hybrid models is an interesting area of study in which researchers can improve the prediction accuracy in water demand forecasting problems. While hybridi- zation methods seem to be tested and evaluated widely, the ensemble methods are not studied sufficiently. The effectiveness of ensemble methods are proved in many occasions and in other areas (Nielsen et al. 2004; Taylor et al. 2009), and water demand forecasting can certainly benefit from this methodology. Much of the available data on water consumption is used for developing forecasting models that are non- linear, and it is shown by (Tabesh and Dini 2009a, b) that for this type of data, the models which only use the proven affective factors are meaningfully more accurate than the models that use all of the available data without examining the factor effectiveness. Therefore, it would be reasonable to conclude that in future studies, the test of effectiveness would be performed before considering all of the available data as the input of the forecasting model. One of the other main findings in all categories of this review study is that there is not a method or model which shows the best forecasting accuracy for all types of problems. However, some of the more recent studies have shown that the developed ANN models produce more accurate forecasts than the other methods in most cases. This accuracy can be related to the capability of ANNs in terms of analyzing the non-linear data, but dealing with the non-stationary data is still an obstacle in using the ANNs. Some studies show that for forecast- ing the long-term consumption where the trend and non- stationarity are more visible, the accuracy of the ANNs is less than in ARIMA models; however, ANNs can improve their forecasting accuracy by applying ana- lyzed data using wavelet analysis (Tiwari and Adamowski 2013). Besides the unexplored areas of soft computing methods in water demand forecasting, this review shows that soft computing methods are mostly focused on specific areas of water demand forecasting. For instance, there are very few studies dedicated to medium- to long- term demand forecasting. In neural network literature, only RBFN and GRNN architectures are used for medium- to long-term forecasting. In this case, one possible explanation may be the inefficiency of basic ANN architecture, such as FNN, in dealing with noisy data. For long-term forecasting, noisy data can lead to significant deviations from the reality, and hence, more complex ANN architectures might be needed to deal with this issue. This focus on short-term water demand forecasting can be observed in other areas of soft computing as well. However, it is difficult to observe this trend in the case of metaheuristics. This is mainly because in water de- mand forecasting, metaheuristics are used as a fine- tuning or parameter estimation tool, and are not directly applied to the forecasting task. Three major categories of variables were found to be used as predictors in soft computing methods in water demand forecasting; consumption, climatic, and socio- economic. Consumption variables mostly include the historical patterns of consumption and—depending up- on the application of the study—vary from previous hours to previous years. Climatic variables mainly re- cord the parameters such as temperature, humidity, and levels of snow and rainfall. Socioeconomic variables mostly take population, growth rates, and economic parameters into account. It was found that while all of these three predictor types were used in the literature, long-term forecasting studies usually did not use socio- economic data. Conclusions This paper has reviewed articles of water demand fore- casting models from 2005 to 2015 with a focus on soft computing methodologies. The aim was to provide an integrated viewpoint of soft computing methods for the use of practitioners who want to make decisions and for researchers who want to contribute to the field. The reviewed papers are categorized according to the main applied forecasting method, and many studies confirm the improved performance of the innovative hybrid models when compared to classical ones. The reviewed studies showed that there were several major topics in soft computing that have not yet been used in water demand forecasting. These topics included various ANN architectures, unsupervised methods, deep learning, various metaheuristics, and ensemble methods. Furthermore, it was discussed that, while in short-term forecasting ANNs have been superior in Environ Monit Assess (2017) 189: 313 Page 9 of 13 313 many cases, it is still very difficult to pick a single method as the overall best. Besides the soft computing methods reviewed, it was also found that these methods were mostly used in short- term demand forecasting, and there were few cases focusing on medium- to long-term forecasting. In terms of predictors of water demand, three major categories were recognized—namely, consumption, climatic, and socioeconomic variables. It was found that in long-term forecasting models, socioeconomic predictors were not normally used. Although many criteria were used to find if a model had a good prediction accuracy or not, analyzing the pros and cons of each accuracy assessment criterion in regard to the nature of the forecasting problem could still be an area for future research. Most of the reviewed studies considered the data of a city or a country for developing models, but it seems developing models with the high accuracy of forecasting water consump- tion in a smaller area is an interesting possibility for future research. It seems that by using the data of a larger number of consumers, the noise of the data has less effect, and it is easier to forecast accurately using larger datasets. However, the same cannot be said for small sample sizes (Braun et al. 2014). In conclusion, it seems that there is still a need to develop more accurate models for forecasting water consumption, and this field is not utilizing the full potential that soft computing offers. References Adamowski, J. F. (2008). Peak daily water demand forecast modeling using artificial neural networks. Journal of Water Resources Planning and Management, 134(2), 119–128. Adamowski, J., & Karapataki, C. (2010). Comparison of multi- variate regression and artificial neural networks for peak urban water-demand forecasting: evaluation of different ANN learning algorithms. Journal of Hydrologic Engineering, 15(10), 729–743. Adamowski, J., Fung Chan, H., Prasher, S. O., Ozga-Zielinski, B., & Sliusarieva, A. (2012). Comparison of multiple linear and nonlinear regression, autoregressive integrated moving aver- age, artificial neural network, and wavelet artificial neural network methods for urban water demand forecasting in Montreal, Canada. Water Resources Research, 48(1), W01528. Ahmadi, S., Alizadeh, S., Forouzideh, N., Yeh, C.-H., Martin, R., & Papageorgiou, E. (2014). ICLA imperialist competitive learning algorithm for fuzzy cognitive map: application to water demand forecasting. In: 2014 I.E. International Conference on Fuzzy Systems (FUZZ-IEEE), (pp. 1041– 1048): IEEE. Alvisi, S., Franchini, M., & Marinelli, A. (2007). A short-term, pattern-based model for water-demand forecasting. Journal of Hydroinformatics, 9(1), 39–50. Amin-Naseri, M., Ardjmand, E., & Weckman, G. (2013). Training the feedforward neural network using unconscious search. In: Neural Networks (IJCNN), the 2013 International Joint Conference on, (pp. 1–7): IEEE. Arbués, F., Garcıa-Valiñas, M. Á., & Martınez-Espiñeira, R. (2003). Estimation of residential water demand: a state-of- the-art review. The Journal of Socio-Economics, 32(1), 81– 102. Ardjmand, E., Millie, D. F., Ghalehkhondabi, I., Young II, W. A., & Weckman, G. R. (2016). A state-based sensitivity analysis for distinguishing the global importance of predictor vari- ables in artificial neural networks. Advances in artificial neural systems. Atsalakis, G., Minoudaki, C., Markatos, N., Stamou, A., Beltrao, J., Panagopoulos, T., et al. (2007). Daily irrigation water demand prediction using adaptive neuro-fuzzy inferences systems (ANFIS). In: Proc. 3rd IASME/WSEAS International Conference on Energy, Environment, Ecosystems and Sustainable Development. Azadeh, A., Neshat, N., & Hamidipour, H. (2011). Hybrid fuzzy regression–artificial neural network for improvement of short-term water consumption estimation and forecasting in uncertain and complex environments: case of a large metro- politan city. Journal of Water Resources Planning and Management, 138(1), 71–75. Babel, M. S., & Shinde, V. R. (2011). Identifying prominent explanatory variables for water demand prediction using artificial neural networks: A case study of Bangkok. Water Resources Management, 25(6), 1653–1676. Bäck, T., & Schwefel, H.-P. (1993). An overview of evolutionary algorithms for parameter optimization. Evolutionary Computation, 1(1), 1–23. Bai, Y., Wang, P., Li, C., Xie, J., & Wang, Y. (2014). A multi-scale relevance vector regression approach for daily urban water demand forecasting. Journal of Hydrology, 517,236–245. Barbounis, T. G., Theocharis, J. B., Alexiadis, M. C., & Dokopoulos, P. S. (2006). Long-term wind speed and power forecasting using local recurrent neural network models. IEEE Transactions on Energy Conversion, 21(1), 273–284. Basak, D., Pal, S., & Patranabis, D. C. (2007). Support vector regression. Neural Information Processing-Letters and Reviews, 11(10), 203–224. Bennett, C., Stewart, R. A., & Beal, C. D. (2013). ANN-based residential water end-use demand forecasting model. Expert Systems with Applications, 40(4), 1014–1023. Billings, R. B., & Jones, C. V. (2011). Forecasting urban water demand: American Water Works Association. Bonissone, P. P. (1997). Soft computing: the convergence of emerg- ing reasoning technologies. Soft Computing, 1(1), 6–18. Boser, B. E., Guyon, I. M., & Vapnik, V. N. (1992). A training algorithm for optimal margin classifiers. In Proceedings of the fifth annual workshop on Computational learning theory, (pp. 144–152): ACM. Bougadis, J., Adamowski, K., & Diduch, R. (2005). Short-term municipal water demand forecasting. Hydrological Processes, 19(1), 137–148. 313 Page 10 of 13 Environ Monit Assess (2017) 189: 313 Braun, M., Bernard, T., Piller, O., & Sedehizade, F. (2014). 24- hours demand forecasting based on SARIMA and support vector machines. Procedia Engineering, 89,926–933. Bullinaria, J. A. (2014). Radial basis function networks: algo- rithms. University of Birmingham, UK, 6–7. Campisi-Pinto, S., Adamowski, J., & Oron, G. (2012). Forecasting urban water demand via wavelet-denoising and neural net- work models. Case study: city of Syracuse, Italy. Water Resources Management, 26(12), 3539–3558. Chen, L., & Zhang, T.-Q. (2006). Hourly water demand forecast model based on least squares support vector machine [J]. Journal of Harbin Institute of Technology, 9,030. Commission, Q. W. (2009). Southeast Queensland Water Strategy, Revised Draft November 2009. The State of Queensland (Queensland Water Commission) November. Cutore, P., Campisano, A., Kapelan, Z., Modica, C., & Savic, D. (2008). Probabilistic prediction of urban water consumption using the SCEM-UA algorithm. Urban Water Journal, 5(2), 125–132. Dhungel, R., & Fiedler, F. (2014). Price elasticity of water demand in a small college town: an inclusion of system dynamics approach for water demand forecast. Air, Soil and Water Research, 7,77. Djukanovic, M., Babic, B., Sobajic, D. J., & Pao, Y.-H. (1993). Unsupervised/supervised learning concept for 24-house load forecasting. In: IEE Proceedings C-Generation, Transmission and Distribution, (Vol. 140, pp. 311–318, Vol. 4): IET. Donkor, E. A., Mazzuchi, T. A., Soyer, R., & Alan Roberson, J. (2012). Urban water demand forecasting: review of methods and models. Journal of Water Resources Planning and Management, 140(2), 146–159. Dziegielewski, B., & Baumann, D. D. (1992). Tapping alterna- tives: the benefits of managing urban water demands. Environment: Science and Policy for Sustainable Development, 34(9), 6–41. Fahlman, S. E., & Lebiere, C. (1989). The cascade-correlation learning architecture. Firat, M., Turan, M. E., & Yurdusev, M. A. (2010). Comparative analysis of neural network techniques for predicting water consumption time series. Journal of Hydrology, 384(1), 46– 51. Forrester, J. W. (1961). Industrial dynamics. Cambridge: MIT Press. Funahashi, K.-I. (1989). On the approximate realization of contin- uous mappings by neural networks. Neural Networks, 2(3), 183–192. Gabriel, M. (2008). Drought-hit Cyprus starts emergency water rations. (Internet). New York. Ghiassi, M., & Saidane, H. (2005). A dynamic architecture for artificial neural networks. Neurocomputing, 63,397–413. Ghiassi, M., Zimbra, D. K., & Saidane, H. (2008). Urban water demand forecasting with a dynamic artificial neural network model. Journal of Water Resources Planning and Management, 134(2), 138–146. Glover, F. W., & Kochenberger, G. A. (2006). Handbook of metaheuristics (Vol. 57): Springer Science & Business Media. Gohari, A., Eslamian, S., Mirchi, A., Abedi-Koupaei, J., Bavani, A. M., & Madani, K. (2013). Water transfer as a solution to water shortage: a fix that can backfire. Journal of Hydrology, 491,23–39. Gutzler, D. S., & Nims, J. S. (2005). Interannual variability of water demand and summer climate in Albuquerque, New Mexico. Journal of Applied Meteorology, 44(12), 1777– 1787. Herrera, M., Torgo, L., Izquierdo, J., & Pérez-García, R. (2010). Predictive models for forecasting hourly urban water de- mand. Journal of Hydrology, 387(1), 141–150. Holland, J. H. (1975). Adaptation in natural and artificial systems: an introductory analysis with applications to biology, control, and artificial intelligence: U Michigan Press. Hong, T.-P., Lin, K.-Y., & Wang, S.-L. (2003). Fuzzy data mining for interesting generalized association rules. Fuzzy Sets and Systems, 138(2), 255–269. Hornik, K., Stinchcombe, M., & White, H. (1989). Multilayer feedforward networks are universal approximators. Neural Networks, 2(5), 359–366. House-Peters, L. A., & Chang, H. (2011). Urban water demand modeling: review of concepts, methods, and organizing prin- ciples. Water Resources Research, 47(5), W05401. Iyatomi, H., & Hagiwara, M. (2004). Adaptive fuzzy inference neural network. Pattern Recognition, 37(10), 2049–2057. Jain, A., Varshney, A. K., & Joshi, U. C. (2001). Short-term water demand forecast modelling at IIT Kanpur using artificial neural networks. Water Resources Management, 15(5), 299–321. Ji, G., Wang, J., Ge, Y., & Liu, H. (2014). Urban water demand forecasting by LS-SVM with tuning based on elitist teaching- learning-based optimization. In The 26th Chinese Control and Decision Conference (2014 CCDC), (pp. 3997–4002): IEEE. Kuan, C. M., & Liu, T. (1995). Forecasting exchange rates using feedforward and recurrent neural networks. Journal of Applied Econometrics, 10(4), 347–364. Lei, C. (2009). Hourly water demand forecast model based on ν- support vector machine. Journal of Basic Science and Engineering, 17(4), 543–548. Lei, C. (2011). Genetic least squares support vector machine approach to hourly water consumption prediction. Journal of Zhejiang University (Engineering Science), 6,022. Li, W., & Huicheng, Z. (2010). Urban water demand forecasting based on HP filter and fuzzy neural network. Journal of Hydroinformatics, 12(2), 172–184. Liu, J.-P., & Chang, M.-Q. (2008). Water demand prediction model based on support vector machine. Journal-Taiyuan University of Technology, 39(3), 299. Liu, J., & Chang, M. (2010). Application of the grey theory and the neural network in water demand forecast. In: 2010 Sixth International Conference on Natural Computation, (Vol. 2, pp. 1070–1073): IEEE. Liu, E. M., Yang, K., Zhao, Y. C., Li, C. H., & Li, X. (2008). Application of system dynamic analysis and the block pre- diction method in industrial water demand. China Rural Water and Hydropower, 4,021. Liu, H., Deng, T., & Zhang, H. (2009). Research on forecasting method of urban water demand based on fuzzy theory. In fuzzy systems and knowledge discovery, 2009. FSKD'09. Sixth International Conference on, (Vol. 6, pp. 389–395): IEEE. Liu, J.-Q., Cheng, W.-P., & Zhang, T.-Q. (2012). Principal factor analysis for forecasting diurnal water-demand pattern using combined rough-set and fuzzy-clustering technique. Journal of Water Resources Planning and Management, 139(1), 23–33. Environ Monit Assess (2017) 189: 313 Page 11 of 13 313 Maas, T. (2003). What the experts think: understanding urban water demand management in Canada: POLIS Project on Ecological Governance. Mamlook, R., Badran, O., & Abdulhadi, E. (2009). A fuzzy inference model for short-term load forecasting. Energy Policy, 37(4), 1239–1248. Millie, D. F., Weckman, G. R., Fahnenstiel, G. L., Carrick, H. J., Ardjmand, E., Young, W. A., et al. (2014). Using artificial intelligence for CyanoHAB niche modeling: discovery and visualization of microcystis–environmental associations within western Lake Erie. Canadian Journal of Fisheries and Aquatic Sciences, 71(11), 1642–1654. Minu, K., Lineesh, M., & John, C. J. (2010). Wavelet neural networks for nonlinear time series analysis. Applied Mathematical Sciences, 4(50), 2485–2495. Mitra, S., Pal, S. K., & Mitra, P. (2002). Data mining in soft computing framework: a survey. IEEE Transactions on Neural Networks, 13(1), 3–14. Mohammed, J. R., & Ibrahim, H. M. (2012). Hybrid wavelet artificial neural network model for municipal water demand forecasting. ARPN Journal of Engineering and Applied Sciences, 7(8), 1047–1065. Msiza, I. S., Nelwamondo, F. V., & Marwala, T. (2007). Artificial neural networks and support vector machines for water de- mand time series forecasting. In: 2007 I.E. International Conference on Systems, Man and Cybernetics, (pp. 638– 643): IEEE. Nasseri, M., Moeini, A., & Tabesh, M. (2011). Forecasting month- ly urban water demand using extended Kalman filter and genetic programming. Expert Systems with Applications, 38(6), 7387–7395. Nauck, D., & Kruse, R. (1997). A neuro-fuzzy method to learn fuzzy classification rules from data. Fuzzy Sets and Systems, 89(3), 277–288. Nielsen, H. A., Madsen, H., Nielsen, T. S., Badger, J., Giebel, G., Landberg, L., et al. (2004). Wind power ensemble forecast- ing. In: Proceedings of the 2004 Global Windpower Conference and Exhibition. Odan, F. K., & Reis, L. F. R. (2012). Hybrid water demand forecasting model associating artificial neural network with Fourier series. Journal of Water Resources Planning and Management, 138(3), 245–256. Papageorgiou, E. I., Poczęta, K., & Laspidou, C. (2015). Application of fuzzy cognitive maps to water demand pre- diction. In: Fuzzy Systems (FUZZ-IEEE), 2015 I.E. International Conference on, (pp. 1–8): IEEE. Pavlidis, N., Tasoulis, D., & Vrahatis, M. N. (2003). Financial forecasting through unsupervised clustering and evolutionary trained neural networks. In: Evolutionary Computation, 2003. CEC'03. The 2003 Congress on, (Vol. 4, pp. 2314– 2321): IEEE. Pulido-Calvo, I., & Gutierrez-Estrada, J. C. (2009). Improved irrigation water demand forecasting using a soft-computing hybrid model. Biosystems Engineering, 102(2), 202–218. Pulido-Calvo, I., Montesinos, P., Roldán, J., & Ruiz-Navarro, F. (2007). Linear regressions and neural approaches to water demand forecasting in irrigation districts with telemetry sys- tems. Biosystems Engineering, 97(2), 283–293. Qiu, X., Zhang, L., Ren, Y., Suganthan, P. N., & Amaratunga, G. (2014). Ensemble deep learning for regression and time series forecasting. In: CIEL, (pp. 21–26). Rijun, Z., & Huifang, D. Z. G. (2010). Water demand forecast model of Poyang Lake area based on support vector machine. Water Resources and Power, 4,009. Specht, D. F. (1991). A general regression neural network. IEEE Transactions on Neural Networks, 2(6), 568–576. Sun, Y. F., Chang, H. T., & Miao, Z. J. (2012). Research on BP neural network model for water demand forecasting and its application. In: Applied Mechanics and Materials (vol. 170, pp. 2352–2355): Trans Tech Publ. Tabesh, M., & Dini, M. (2009a). Fuzzy and neuro-fuzzy models for short-term water demand forecasting in Tehran. Iranian Journal of Science & Technology, Transaction B, Engineering, 33(B1), 61–77. Tabesh, M., & Dini, M. (2009b). Fuzzy and neuro-fuzzy models for short-term water demand forecasting in Tehran. Iranian Journal of Science and Technology, 33(B1), 61. Taylor, J. W., McSharry, P. E., & Buizza, R. (2009). Wind power density forecasting using ensemble predictions and time se- ries models. IEEE Transactions on Energy Conversion, 24(3), 775–782. Tiwari, M. K., & Adamowski, J. (2013). Urban water demand forecasting and uncertainty assessment using ensemble wavelet-bootstrap-neural network models. Water Resources Research, 49(10), 6486–6507. Tu-qiao, C. L. Z. (2006). Hourly water demand forecast model based on Bayesian least squares support vector machine [J]. Journal of Tianjin University, 9,005. Vapnik, V. (2013). The nature of statistical learning theory: Springer Science & Business Media. Varahrami, V. (2010). Application of genetic algorithm to neural network forecasting of short-term water demand. In International Conference on Applied Economics—ICOAE, (pp. 783–787): Citeseer. Vijayalaksmi, D., & Babu, K. J. (2015). Water supply system demand forecasting using adaptive neuro-fuzzy inference system. Aquatic Procedia, 4,950–956. Wang, L., Zhang, H.-W., & Niu, Z.-G. (2005). Application of support vector machines in short-term prediction of urban water consumption [J]. Journal of Tianjin University, 11,018. White, S., Robinson, J., Cordell, D., Jha, M., & Milne, G. (2007). Urban Water demand forecasting and demand management: research needs review and recommendations. Worthington, A. C., & Hoffman, M. (2008). An empirical survey of residential water demand modelling. Journal of Economic Surveys, 22(5), 842–871. Wu, Z. Y., & Yan, X. (2010). Applying genetic programming approaches to short-term water demand forecast for district water system. In: Water Distribution Systems Analysis 2010, (pp. 1498–1506): ASCE. Yanyan, P. (2012). Intellectualization projection pursuit regression model used in the water demand forecasting. In: Engineering Education and Management (pp. 505–510): Springer. Yingwei, L., Sundararajan, N., & Saratchandran, P. (1997). A sequential learning scheme for function approximation using minimal radial basis function neural networks. Neural Computation, 9(2), 461–478. Yurdusev, M. A., Firat, M., Mermer, M., & Turan, M. E. (2009). Water use prediction by radial and feed-forward neural nets. In: Proceedings of the Institution of Civil Engineers-Water Management (vol. 162, pp. 179–188, Vol. 3): Thomas Telford Ltd. 313 Page 12 of 13 Environ Monit Assess (2017) 189: 313 Zadeh, L. A. (1994). Fuzzy logic, neural networks, and soft computing. Communications of the ACM, 37(3), 77– 85. Zhai, C., Zhang, H., & Zhang, X. (2009). Application of system dynamics in the forecasting water resources demand in Tianjin Polytechnic University. In: International Conference on Artificial Intelligence and Computational Intelligence, Shanghai, China, IEEE. Zhang, G., Patuwo, B. E., & Hu, M. Y. (1998). Forecasting with artificial neural networks: the state of the art. International Journal of Forecasting, 14(1), 35–62. Zhang, L., Wei, Y., & Wang, Z. (2008). Prediction on ecological water demand based on support vector machine. In: Computer Science and Software Engineering, 2008 International Conference on (vol. 5, pp. 1032–1035): IEEE. Zhang, H., Zhang, X., & Zhang, B. A. (2009). System dynamics approach to urban water demand forecasting. Transactions of Tianjin University, 15,70–74. Zhou, J., & Yang, K. (2010). General regression neural network forecasting model based on PSO algorithm in water demand. In: Knowledge Acquisition and Modeling (KAM), 2010 3rd International Symposium on, (pp. 51–54): IEEE. Environ Monit Assess (2017) 189: 313 Page 13 of 13 313","libVersion":"0.0.0","langs":"","hash":"","size":0}