{"path":".obsidian/plugins/text-extractor/cache/小绿/profane-世俗-论文-【小绿鲸】超棒的英文文献阅读器（附安装包+总结笔记+思维导图）-1.基本功能介绍-小绿鲸独家文献阅读教程.pdf-ff77a38009e21385e607498275a52142.json","text":"小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 文献阅读教程 对大多数科研人来说，读英文文献都是科研的第一道坎儿，读文献时会遇到各种难题：阅读效率 低，读不懂，读完没收获、没思路，读完记不住。为了帮助大家彻底解决这些读文献的烦恼，小绿鲸 英文文献阅读器诞生了，下面为你介绍如何用小绿鲸高效读懂文献。 想必大家电脑都有个上百篇文献，不可能逐一仔细阅读，所以需要先阅读一下文章题目、摘要、 前言以及文章中的图表，了解大致主要内容后进行文献分类，然后再按需进行不同形式的阅读。 看到这一大串英文，很多人都会感到犯难，但有了小绿鲸就不必头疼，强大的【翻译】功能帮你 快速读懂英文文献。 1. 翻译 1.1 划词翻译 光标选中文献中需翻译的文字，右边即出现译文，可以边读边翻译。在译文上方可点击选择【鲸译 AI 通用版】或【鲸译 AI 学科版】，切换多个翻译引擎，提高翻译精准度。点击译文处【复制】按钮 可直接复制粘贴；如原文格式或内容错误，可点击【修改】按钮进行修改后重新翻译。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 用下面这段摘要试一下吧！ Abstract BACKGROUND: Acute renal failure requiring dialysis after heart transplantation remains a signiﬁcant clinical issue because of its increasing incidence. We aimed to investigate its time trends, clinical predictors, and long-term outcomes. METHODS: Adult heart transplantation recipients registered in the United Network for Organ Sharing registry between 2009 and 2020 were identiﬁed. The patients were grouped according to the requirement for dialysis in the postoperative heart transplantation period. The independent risk predictors were identiﬁed, and the association between post-heart transplantation renal failure requiring dialysis and long-term mortality accounting for re-transplantation was investigated. RESULTS: A total of 28,170 patients were included in the study, of which 3,371 (12%)required dialysis immediately post-heart transplantation. The incidence increased from 7.9% to 13.9% during the study period. Longer ischemic time, serum creatinine at transplantation >1.2 mg/dL, prior cardiac surgery, higher recipient body mass index, support of mechanical ventilation or extracorporeal membrane oxygenation, and history of congenital heart disease or restrictive/hypertrophic cardiomyopathy were its predictors (all p < 0.05). Patients on posttransplant dialysis had a higher risk of all-cause mortality (adjusted hazard ratio [aHR]: 5.2, 95% CI: 4.7-5.7, p < 0.001), 30 day mortality (aHR: 7.7, 95% CI: 6.3-9.6, p < 0.001)and 1 year mortality (aHR: 7.5, 95% CI: 6.6-8.6, p < 0.001). Post-transplant dialysis was associated with a risk of treated rejection at 1 year. CONCLUSION: Acute renal failure requiring dialysis after heart transplantation is associated with significantly worse 30 day and long-term mortalities, and thus, early identiﬁcation of high-risk patients is crucial to prevent severe renal complications. 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 1.2 学科翻译 在划词翻译时，如遇到一些专业词或长难词无法翻译或翻译不准确的情况，可选中对应内容点击下方 工具栏中的【添加术语】，将其重新定义。然后点击右侧翻译引擎切换到【鲸译 AI 学科版】，勾选 【术语库】，再次划词翻译就可以校正翻译结果。 1.3 单词翻译 鼠标左键双击单词，右侧展示单词翻译和例句，可以朗读发音，还能够添加单词本。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 1.4 跨段连续翻译 有些段落不在同一页面上，如果跨页选择会将页眉页脚上的不必要信息也复制过来，此时可以先选中 前一页上需要翻译的文字，点击译文右上角【连翻】按钮，再选中后一页上需要翻译的文字，两段即 可叠加翻译，再次点击按钮取消连续翻译。 用下面这段前言试一下吧！ Introduction AKI occurs in 40% to 70% of HT patients, and it is associated with pre-existing comorbidities, right heart failure, major bleeding, or the use of CNIs. However, little is known regarding its risk factors and its association with the long-term outcomes of HT patients, particularly in those requiring dialysis. In addition, there is also limited evidence on the clinical implications of more severe kidney injury because of its low 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 incidence (about 10%). Although there have been observational studies that evaluated the risk factors for acute dialysis, these studies were performed in a small population and were statistically underpowered to identify signiﬁcant risk factors, suggesting the need for large-scale research. Furthermore, the long-term outcomes of HT patients who required dialysis have not been elucidated. Thus, this study aimed to assess the incidence, trends, and clinical predictors of acute renal failure requiring dialysis after HT and their association with the longterm outcomes among HT patients, using a large-scale cardiac HT registry. 1.5OCR 识别翻译 有时会遇到文献及图表中文字是图片、无法划词翻译或复制的情况，可以点击顶部菜单栏的【OCR 识别】图标，选中想要识别文字内容的区域，即可在右侧译文和原文处得到可复制的原文与译文。 1.6 全文翻译 点击文献上方【全文翻译】图标按钮，可对文献进行全文翻译。译文保留了原文格式，方便对照阅读， 同时支持译文以 word 和 PDF 格式下载，方便进行本地修改。需注意普通用户每月只能翻译 3 次、每 次文档不能超过 30 页。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 在页面右下角会显示全文翻译进度。翻译完成后，点击【首页】-【笔记列表】-【全文翻译】查看翻 译结果，鼠标移动到翻译文献标题处，提示可对翻译结果进行操作：点击【查看】可查看翻译内容， 点击【下载】可下载翻译结果的 doc 或 pdf 文档至本地，点击【导入】可导入翻译结果至文献列表。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 如果不需要查看全文翻译内容，那么看完了摘要和前言后，直接看图表与注释部分可更高效获取文献 信息，可文献很长，直接定位每个图表部分很麻烦，有些地方图表又和注释分开，看起来很难受，这 时小绿鲸的【速读】功能帮你解决以上问题。 2. 速读 2.1 图片速读 点击文献上方【速读】，可以将文献中的图表和图注提取出来，让你快速预览所有图表中重要信息。 点击【翻译图注】可以一键获取中文注释，读懂图表和文章主要内容。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 2.2 参考文献速读 有时文献中会引用/比较其他文献内容/数据，此时想要了解参考文献内容，就可以点击文献上方【速 读】，在右上角点击切换【参考文献】，通过点击【查看文献详情】来查看期刊、作者和摘要，快速 了解参考文献主要内容。如果想要了解更多内容，可以点击文献标题，跳转文献官网去下载/查看更 多。 速读后已经初步了解文章的主要内容，下面就可以对这篇文献进行精读做【笔记】了。 3. 笔记 3.1 大纲式笔记 在同一个页面上可以同时实现读文献+记笔记+划词翻译的三重功能。在阅读过程中可以将文献重点 内容复制或提炼出来，形成大纲式笔记。使用方法如下： ①每篇笔记标题与文献标题一致，鼠标点击标题可直接修改 ②下方每段文字前面的小圆点为一个主题，鼠标点击第一行空白圆点，可直接输入文字 ③点击【Enter】创建新主题 ④点击【Tab】主题缩进一级 ⑤点击【Shitf+Tab】主题提升一级 ⑥点击每个主题前面的加号/减号可展开/收起子主题 ⑦选中文字可出现操作栏，进行一些列笔记标记 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 3.2 笔记模板 小绿鲸总结了一些常用的笔记模板，供大家选择，方便给大家梳理笔记思路，同时给不知道如何做文 献笔记的同学一些参考，大家也可以将自己认为比较好的笔记保存为模板，方便下次直接使用哦~ 3.3 思维导图 大纲式笔记可以转换为思维导图形式，更方便研究思路的梳理。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 在思维导图页面，点击主题也可对格式进行调整。 3.4PDF 与笔记双向定位 在边读文献边做笔记时，你可能需要将重要的内容或图片复制到笔记中。你可以通过以下三种方式实 现： ①直接将文字添加到笔记 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 ②将注释内容添加到笔记 ③截图添加到笔记 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 从 pdf 中添加到笔记里的文字和图片，可以在 pdf 和笔记中双向定位。你可以通过点击笔记中的“链 接到原文”图标，一键在 pdf 中定位原文位置，方便查看上下文。 也可以通过点击 pdf 上添加到笔记中的内容，定位在笔记上的位置。 切换至思维导图模式下也可实现 PDF 与笔记双向定位。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 如果发现这篇文献句式或写作思路有借鉴价值，还可以将文中一些可能用得到的句子收藏起来，供日 后论文【写作】使用。 4. 写作 4.1 引文收藏、语料收藏 选取想要收藏的句子，点击下方工具栏中的【添加引文】和【添加语料】即可添加到引文库和语料库。 此外，还可以点击语料内容导入到上方输入框进行改写。 小绿鲸可以将收藏的引文内容自动进行转述，你也可以点击进行改写。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 所有收藏的语料和引文都可以在首页【语料库】和【引文库】中找到。在语料库中，可以同时将不同 的语料内容导入输入框，进行对比改写。这些长时间积累收藏的句子在写论文时会大有用处。此外， 语料还记录了文献来源，如果想查看语料的语境，直接点击文献标题即可查看。 除了以上这些，小绿鲸还有【其他】一些实用的小功能。 5. 其他 5.1 对比阅读 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 点击上方菜单栏【对比阅读】可选择打开一篇文献，与当前文献进行内容对比阅读，两篇文献在同一 界面打开，可以分别左右滑动查看。 5.2 丰富的文献批注 顶部菜单栏可点击【注释】选择多种批注工具，如高亮、下划线、删除线、注释等；点击【视图】回 到光标状态。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 5.3 文献共读 如果想要分享文献给其他小伙伴，只需点击右上角【设置】按钮，再点击【分享】即可。 文献的数量越来越多，这时通过小绿鲸的【文献管理】功能，就可以从上百篇文献中快速找到目标文 献，并回忆起文献重点信息。 6. 文献管理 6.1 标签、备注、标记重要度、信息预览 读完文献后觉得这篇文献比较有价值，可以通过点击菜单栏【笔记】-【备注】，填写备注信息、标 记重要度和添加标签，方便再次阅读或查找。这些信息也会在文献列表页展示。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 在文献列表页，点击具体某篇文献的【期刊/作者/影响指数/分区】信息可以查看文献题录信息、做过 的备注和笔记，方便记忆和管理。此外，点击文献后面的【...】还可以选择对文献进行置顶/取消置顶 等操作。 在文献列表页，通过点击【重要度】，可以按照重要度对文献进行排序。点击右上角【筛选标签】按 钮，也可以通过标签对文献进行筛选。 6.2 无限创建多级文件夹 除了通过标签对文献分类，还能通过无限创建多级文件夹来对不同特点的文献进行分类管理，点击右 上角【平铺模式/列表模式】可自主切换列表和平铺模式，文件夹也可置顶或移动。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 解决了文献管理问题后，面对大量阅读文献的需求想要省去从检索、下载到导入的繁琐步骤，就可以 使用小绿鲸的【文献检索】了。 7. 文献检索 文献检索功能可快速检索目标文献，并将 pdf 文档一键导入到文献列表中进行文献阅读（下载小绿鲸 客户端即可使用此功能）。 7.1文献检索 小绿鲸默认提供了 7 个常用学术网站供您检索使用，分别是 PubMed、Web of Science、Science Direct、 Semantic Scholar、百度学术、知网、万方。 7.2PDF 文档一键导入 检索到目标文献后，在 pdf 页面点击“一键导入 pdf”按钮，将文档一键导入到文献列表中进行文献 阅读。帮你省去从下载到导入的繁琐步骤。 小绿鲸英文文献阅读器 | www.xljsci.com 高效读文献，就用小绿鲸 7.3自定义搜索引擎 同时为兼顾不同学科鲸英们的检索习惯，你还可以自定义添加常用的检索网站，扩大检索范围。 千里之行始于足下，科研能力的提升绝非一蹴而就，读文献就是一个不断积累的过程。科研之路的开 拓，需要我们日复一日的坚持钻研，深耕领域内的最新知识。了解前沿研究动态，学会感受文献的魅 力，真正做到让读文献成为你的生活习惯之一。 更多小绿鲸功能教程详见 https://www.xljsci.com/download/course.html","libVersion":"0.0.0","langs":"","hash":"","size":0}